------------------------------------------------------------------------------------------
--- НАСТРОЙКИ
--- режим карты:
--- 1. FFA с го от столицы
--- 2. 2x2 со столицами рядом
--- 3. 2x2 с т2 зонами рядом
--- 4. Бесит!(FFA)
--- 5. Бесит!(2x2 т0)
--- 6. Бесит!(2x2 т2)
local gmode = 1
local smode
------------------------------------------------------------------------------------------
--- коэффициент сложности (<0.9 легко; 0.9-1.1 средне; >1.1 сложно) - не применяется к Т0
local kef = 1
------------------------------------------------------------------------------------------
--- режим рынка (только режимы 2x2)
--- 1. отключен
--- 2. включен
local market_mode = 1
------------------------------------------------------------------------------------------
--- режим наемников центр
--- 1. нет (лагеря отсутствуют)
--- 2. обычные (обычные для BR Clover/Duo)
--- 3. сильные (усиленные BR Trinity)
--- 4. оч.сильные (дорогие и сильные юниты)
--- 5. небирос (практически всё что угодно)
local mercenary_mode = 2
--------------------------------------------------------------------------------------------
--- режим границ центральных зон(лепестков)
--- 1. открытые
--- 2. Водные
--- 3. полуоткрытые
--- 4. случайно (для каждой зоны)
--- 5. одинаковые-случайно
--- 6. зеркально-случайно
local border_mode = 1
------------------------------------------------------------------------------------------
--- коэффициент разброса силы нейтралов
local kr = 1.05
------------------------------------------------------------------------------------------
--- количество заклинаний в башнях магии
local sp1 = 15 -- т1
local sp3 = 7 -- т3
------------------------------------------------------------------------------------------

--- КОД ШАБЛОНА
-- переменные для рудников
local mines1 = {0, 1}
local mines2 = {0, 1}
local guardRace = Race.NeutralBarbarian

--  Маг
local mage_c_data = {
	{
		name = 'Столп Ученика',
		description = 'Настоящий мастер — это вечный ученик',
	},
	{
		name = 'у Хрусталя',
		description = 'Комментаторская вышка',
	},
}

-- Торговец
local merchant_c_data = {
	{
		name = '',
		description = '',
	},
	{
		name = 'Магазин Сатонира',
		description = 'У меня лучший CUMпот в округе',
	},
}

-- Тренер
local trainer_c_data = {
	{
		name = '',
		description = '',
	},
	{
		name = 'Лагерь Дедикейшена',
		description = 'Welcome to my GYM, buddy',
	},
}
-- Рынок ресурсов
local market_c_data = {
	{
		name = 'Рынок ресурсов',
		description = 'Огромная вывеска на входе гласит "Верните Мака"',
	}
}

-- Наемники
local desc_b = ''
local unit_b = {}
if math.random(0,1) == 0 then
	desc_b = 'Шаманка здесь и сейчас!'
	unit_b = { id = 'g000uu8046', level = 1, unique = true }
else
	desc_b = 'Шаманок нет, но есть кое что..'
	unit_b = { id = 'g000uu6104', level = 3, unique = true }
end

local merc_c_data = {
	{
		name = 'Бюро по трудоустройству населения',
		description = desc_b,
		unit = unit_b
	},
	{
		name = '',
		description = ''
	},
	{
		name = '',
		description = ''
	},
	{
		name = '',
		description = ''
	},
	{
		name = '',
		description = ''
	},
	{
		name = '',
		description = ''
	},
	{
		name = '',
		description = ''
	},
	{
		name = '',
		description = ''
	},
	{
		name = '',
		description = ''
	},
	{
		name = '',
		description = ''
	},
}

-- Руины
local ruins_c_data = {
	'',
	'',
	'',
	'',
	'',
	'',
	'Без негатива',
	'Твои недра',
}
-- Руины 2
local ruins_t_data = {
	'БИТВА ЗА КОСАРИК!',
	'УЛЬТРА ДРЕВНЕЕ КИТАЙСКОЕ ПРОКЛЯТИЕ НА ЗАЛИВКУ В ЭТИХ РУИНАХ',
}

-- Работники рынка
local workers_c_data = {
	'Ифрит',
	'Хай',
	'Амодеус',
	'Райз',
	'Бэка',
	'Гастрофетус',
	'Фуми',
	'Токсин',
	'Хрусталь',
	'Магвай',
	'Тезос',
	'РингОф',
	'Талион',
	'Зухендер',
	'ОР',
	'Макрометр',
	'Дзаро',
	'Акира',
	'Грон',
	'Сыр Зерг',
	'Протостар',
}

------------------------------------------------------------------------------------------

--Башня магии в зоне 1
function zoneMageResp1()
	local spells_t1 = {
		'g000ss0002', -- быстрота
		'g000ss0007', -- Исцеление
		'g000ss0178', -- Неудача --мэ

		'g000ss0025', -- Призыв I: Рух
		'g000ss0023', -- сила витара

		'g000ss0045', -- tormentio
		'g000ss0044', -- Menta minoris

		'g000ss0134', -- Порченная руна
		'g000ss0064', -- слабость

		'g000ss0101', -- стая
		'g000ss0098', -- Призыв I: Энт Малый

		'g000ss0183', -- сокрушение
		'g000ss0197', -- Заступничество
		'g000ss0131', -- Ослепительная вcпышка

		'g000ss0029', -- Ритуал исцеления
		'g000ss0184', -- прокл.эмира
		'g000ss0034', -- Заколдованное оружие --мэд

		'g000ss0050', -- Chronos
		'g000ss0185', -- terebrare corde

		'g000ss0186', -- Спешащее время
		'g000ss0069', -- Проклятие Ниграэля
		'g000ss0124', -- Отсрочка неизбежного

		'g000ss0187', -- могущество
		'g000ss0133', -- Песнь слез
		'g000ss0107', -- Дикие саженцы --мж
	}
	return {
		{
			spells = chooseSpells(spells_t1, sp1)
		}
	}
end


--Башня магии в зоне 3
local spells_t3_1 = {
	'g000ss0013', -- Святая сила +15 точн и урон
	'g000ss0026', -- Гимн Кланов +15 ини
	'g000ss0089', -- Preces -15 точн и урон
	'g000ss0074', -- Туман Смерти
	'g000ss0108', -- Призыв III: Энт Большой

	'g000ss0082', -- Благословение Всевышнего +20%хп +5 брони 1200
	'g000ss0114', -- Плесень

	'g000ss0079', -- Защита от Оружия

	'g000ss0207', -- Пробирающий холод -вард вода
	'g000ss0208', -- Хворь -вард земля
}

local spells_t3_2 = {
	'g000ss0012', -- Святая броня + 15 Брони
	'g000ss0031', -- Призыв II: Валькирия
	'g000ss0199', -- Terra oblivionem -25опыт
	'g000ss0073', -- Прикосновение Мортис +20% ХП
	'g000ss0111', -- Отвлечение -15 точн и урон

	'g000ss0091', -- Tempus status -33 ини 1200
	'g000ss0116', -- Благословение Галеана +50хп

	'g000ss0039', -- Неподкупность

	'g000ss0206', -- Dominatum ignis -вард огонь
	'g000ss0209', -- Небесный молот -вард воздух
}

local spells_special = {
	{
		a = 'g000ss0145', -- Потоп
	},
	{
		a = 'g000ss0107', -- Дикие саженцы
		b = 'g000ss0027', -- Мореплавание
	}
}

function zoneMageZone3(mage_id)
	if mage_id == 1 then
		local spells_list = chooseSpells(spells_t3_1, sp3)
		for _,v in pairs(spells_special[mage_id]) do
			table.insert(spells_list, v)
		end
		return {
			{
				name = mage_c_data[mage_id].name,
				description = mage_c_data[mage_id].description,
				spells = spells_list
			}
		}
	elseif mage_id == 2 then
		local spells_list = chooseSpells(spells_t3_2, sp3)
		for _,v in pairs(spells_special[mage_id]) do
			table.insert(spells_list, v)
		end
		return {
			{
				name = mage_c_data[mage_id].name,
				description = mage_c_data[mage_id].description,
				spells = spells_list
			}
		}
	end
end

----------------------
-- Город 1
function zoneTownsResp0(race)
	local valueTowerResp0 = { min = 240*kef, max = 240*kef*kr }
	return {
	{
		tier = 1,
		gapMask = 15,
		stack = {
			subraceTypes = rsub(),
			value = valueTowerResp0,
			loot = {
				itemTypes = { Item.Scroll, Item.Orb },
				value = { min = 400, max = 400 },
				itemValue = { min = 400, max = 400 },
				items = {
					{ id = 'g000ig0001', min = 1, max = 1 }, --рес
					{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
					rnd({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), --2хил25/хил50
					rnd({ id = ExtraManaProject4(race), min = 1, max = 1 }, { id = 'g001ig0432', min = 1, max = 1 }), --доп.шар / аметист125
					{ id = rndAndSave(perks_perm, {'g001ig0529', 'g001ig0531'}, {'g001ig0531'}), min = 1, max = 1 }, -- Каталог магических сфер (сферы) / Зелье слова (свитки)
					yn({ id = b15(), min = 1, max = 1 }), --банка15
					{ id = e4(), min = 1, max = 1 },
				}
			}
		}
	}
	}
end

-- Город 2
function zoneTowns2(race)
	local valueTowerZone = { min = 450*kef, max = 450*kef*kr }
	return {
	{
		tier = 1,
		gapMask = 15,
		stack = {
			subraceTypes = NoUndead(),
			value = valueTowerZone,
			loot = {
				itemTypes = { Item.Scroll, Item.Orb },
				value = { min = 450, max = 600 },
				itemValue = { min = 450, max = 690 },
				items = {
					{ id = 'g000ig0001', min = 1, max = 1 }, --рес
					{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
					rnd({ id = 'g000ig0006', min = 1, max = 1 }, { id = 'g000ig0005', min = 2, max = 2 }), --хил100/2хил50
					rnd({ id = ExtraManaProject4(race), min = 1, max = 1 }, { id = ExtraHomeMana(race), min = 1, max = 1 }, { id = 'g000ig7003', min = 1, max = 1 }), -- доп.шар / родной шар / изумруд150
					rnd({ id = 'g002ig0005', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}), -- Зелье наблюдательности / Зелье магической устойчивости
					rnd({ id = b15(), min = 1, max = 1 }, { id = w15(), min = 1, max = 1 }, { id = 'g002ig0007', min = 1, max = 1 }), -- случ. банка15 / случ. вард / Зелье магической устойчивости
					{ id = pw5(), min = 1, max = 1 },
					{ id = rndAndSave(perks_perm, {'g001ig0525', 'g001ig0528'}, {}), min = 1, max = 1 }, -- Эликсир учености (артефакты) / Честный труд (походное снаряжение)
				}
			}
		}
	},
	}
end

-- Город 4
function zoneTownsZone4()
	return {
	{
		tier = 1,
		gapMask = 15,
		name = 'г.Стримерск',
		stack = {
			subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
			value = { min = 1100*kef, max = 1100*kef*kr },
			loot = {
				itemTypes = { Item.Scroll, Item.Orb },
				value = { min = 700, max = 800 },
				itemValue = { min = 700, max = 890 },
				items = {
					{ id = 'g000ig0001', min = 1, max = 1 }, --рес
					{ id = 'g000ig0006', min = 2, max = 2 }, --хил100
					rnd({ id = 'g000ig0006', min = 1, max = 1 }, { id = 'g000ig0005', min = 2, max = 2 }), --хил100/2хил50
					rnd({ id = rmsb(), min = 1, max = 1 }, { id = 'g001ig0433', min = 1, max = 1 }), --случ. большой шар манны / аквамарин175
					rnd({ id = 'g001ig0563', min = 1, max = 1}, { id = 'g001ig0035', min = 1, max = 1}, { id = 'g001ig0019', min = 1, max = 1}, { id = 'g001ig0506', min = 1, max = 1}),	-- Аура внимательности +5 крит / Великая аура жизненной силы +30хп / Малая аура вампиризма +10вамп / Настойка оратора +1лидер
					yn(rnd({ id = b30(), min = 1, max = 1 },{ id = 'g002ig0006', min = 1, max = 1 })), --случ. банка30 / Зелье бдительности -30воры
					{ id = 'g000ig6017', min = 1, max = 1}, -- Посох дневного света
				}
			}
		}
	}
	}
end

----------------------

-- Лавка т1
function zoneMerch1() -- свитки 400
return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 800, max = 800 },
			itemValue = { min = 400, max = 400 },
			items = {
				{ id = 'g000ig0001', min = 3, max = 4 },
				{ id = 'g000ig0006', min = 3, max = 4 },
				{ id = 'g001ig0378', min = 4, max = 5 }, --хил75
				{ id = 'g000ig0005', min = 5, max = 7 },
				{ id = 'g001ig0180', min = 7, max = 10 },

				{ id = 'g000ig0002', min = 1, max = 2 }, --15з
				{ id = 'g000ig0014', min = 1, max = 1 }, --15а
				{ id = 'g000ig0011', min = 1, max = 2 }, --15и
				{ id = 'g000ig0008', min = 1, max = 1 }, --15т

				{ id = 'g000ig0021', min = 1, max = 2 }, -- вард в
				{ id = 'g000ig0022', min = 1, max = 1 }, -- вард в
				{ id = 'g000ig0023', min = 1, max = 1 }, -- вард з
				{ id = 'g000ig0024', min = 1, max = 2 }, -- вард о

				rnd({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти

				{ id = d15(), min = 1, max = 1 }, -- случ. дотвард

				{ id = 'g002ig0007', min = 1, max = 1 }, --Зелье магической устойчивости
				rnd({ id = 'g002ig0005', min = 1, max = 1}, { id = 'g002ig0007', min = 1, max = 1}), -- Зелье наблюдательности / Зелье магической устойчивости

				{ id = e2(), min = 1, max = 1},
				{ id = e2(), min = 1, max = 1},
				{ id = e4(), min = 1, max = 1},

				rnd({ id = 'g001ig0533', min = 1, max = 1 }, { id = 'g001ig0006', min = 1, max = 1 }), -- Зелье ясного взора (+2 обзора) / Эликсир маскировки (-50 опыт за его уб-во)
				rnd({ id = 'g001ig0027', min = 1, max = 1 }, { id = 'g000ig0013', min = 1, max = 1 }), -- аура брони +5 брони аое / Эликсир неуловимости +10 ини
				rnd({ id = 'g001ig0130', min = 1, max = 1 }, { id = 'g001ig0561', min = 1, max = 1 }), -- Эликсир регенерации +20 / эликсир самопожертвования

				{ id = rndAndSave(perks_perm, {'g001ig0526', 'g001ig0527'}, {}), min = 1, max = 1 }, -- Зелье оруженосца (знаменосец) / Зелье постижения (тайное знание)

				rnd({ id = 'g000ig3001', min = 1, max = 1}, { id = 'g000ig2001', min = 1, max = 1}, { id = 'g001ig0100', min = 1, max = 1}, { id = 'g001ig0101', min = 1, max = 1}), -- Гномьи наручи (Артефакт) / Рунный камень (Артефакт) | Цеп Хана (Артефакт) / Череп Хана (Реликвия)
				yn({ id = 'g001ig0611', min = 1, max = 1 }), -- Цепи жертвенности (Артефакт)
				yn({ id = 'g002ig0001', min = 1, max = 1 }), -- Потайной кинжал (Артефакт)
				yn({ id = 'g001ig0609', min = 1, max = 1 }), -- Загробный фонарь (Артефакт)
				yn({ id = 'g001ig0418', min = 1, max = 1 }), -- Руна защиты Фрейра (Артефакт)

				yn({ id = 'g000ig2002', min = 1, max = 1 }), -- св.чаша
				yn({ id = 'g000ig3002', min = 1, max = 1 }), -- д.чаша
				yn({ id = 'g001ig0182', min = 1, max = 1 }), -- счастл. кость
				yn({ id = 'g000ig3017', min = 1, max = 1 }), -- кинж. вамп.
				yn({ id = 'g001ig0048', min = 1, max = 1 }), -- Амулет Кракена (Артефакт)
				yn({ id = 'g001ig0487', min = 1, max = 1 }), -- Кольцо темных искуств (Артефакт)650
				yn({ id = 'g001ig0559', min = 1, max = 1 }), -- Руна благоволения Тиу (Артефакт) 700
				yn({ id = 'g001ig0557', min = 1, max = 1 }), -- Рог непреклонности (Артефакт) 700
				yn({ id = 'g001ig0558', min = 1, max = 1 }), -- Рог возмездия (Артефакт) 700
				yn({ id = 'g001ig0594', min = 1, max = 1 }), -- Щит телохранителя (Артефакт) 700

				yn({ id = 'g001ig0421', min = 1, max = 1 }), -- Борода Имира (Реликвия)
				yn({ id = 'g001ig0610', min = 1, max = 1 }), -- Оковы долга (Реликвия)
				yn({ id = 'g001ig0426', min = 1, max = 1 }), -- Куртка капитана (Реликвия)

				yn({ id = 'g001ig0104', min = 1, max = 1 }), -- зуб людоеда
				yn({ id = 'g000ig3022', min = 1, max = 1 }), -- р.лютня650
				yn({ id = 'g001ig0605', min = 1, max = 1 }), -- Книга постижения600
				yn({ id = 'g000ig3020', min = 1, max = 1 }), -- череп танатоса500
				yn({ id = 'g001ig0099', min = 1, max = 1 }), -- перчатки
				yn({ id = 'g000ig4001', min = 1, max = 1 }), -- книга возд
				yn({ id = 'g000ig4002', min = 1, max = 1 }), -- книга воды
				yn({ id = 'g000ig4003', min = 1, max = 1 }), -- книга земли
				yn({ id = 'g000ig4004', min = 1, max = 1 }), -- книга огня
				yn({ id = 'g000ig4007', min = 1, max = 1 }), -- Медицинский трактат

				--сапоги
				rnd({ id = 'g001ig0105', min = 1, max = 1 }, { id = 'g001ig0107', min = 1, max = 1 }, { id = 'g001ig0108', min = 1, max = 1 }, { id = 'g001ig0106', min = 1, max = 1 }), -- Литейные сапоги / Сапоги ветров / Гномьи сапоги / Сапоги каменщика
				rnd({ id = 'g001ig0113', min = 1, max = 1 }, { id = 'g001ig0110', min = 1, max = 1 }), -- сапоги укрепл / лёгкие

				--посох
				rnd({ id = 'g001ig0383', min = 1, max = 1 }, { id = 'g001ig0387', min = 1, max = 1 }, { id = 'g000ig6001', min = 1, max = 1 }, { id = 'g000ig6003', min = 1, max = 1 }), -- Посох первых побегов (малый энт) / Посох следопыта (хождение по лесу) / Посох грома (15 дамаг) / Посох святости+30оз
				rnd({ id = 'g001ig0394', min = 1, max = 1 }, { id = 'g000ig6012', min = 1, max = 1 }, { id = 'g001ig0395', min = 1, max = 1 }, { id = 'g001ig0399', min = 1, max = 1 }), -- Посох северных стражей+10брони / Посох скорости+10ини / Посох наместника Махаля+10брони / Посох раздора-10ини

				--сферы
				yn({ id = 'g001ig0458', min = 1, max = 1}), -- Сфера Каменного проклятия 100
				yn({ id = 'g000ig9031', min = 1, max = 1}), -- Сфера Ливня 100
				yn({ id = 'g000ig9022', min = 1, max = 1}), -- Сфера Углей 100
				yn({ id = 'g001ig0302', min = 1, max = 1}), -- Сфера Шторма 100
				yn({ id = 'g001ig0189', min = 1, max = 1}), -- Сфера Камня 100
				yn({ id = 'g001ig0178', min = 1, max = 1}), -- Сфера Костра 100
				yn({ id = 'g001ig0472', min = 1, max = 1}), -- Сфера Ледяного осколка 100
				yn({ id = 'g001ig0473', min = 1, max = 1}), -- Сфера Статического разряда 100
				yn({ id = 'g001ig0470', min = 1, max = 1}), -- Сфера Подавления 100
				yn({ id = 'g001ig0192', min = 1, max = 1}), -- Сфера Пыток 100
				yn({ id = 'g000ig9033', min = 1, max = 1}), -- Сфера Чумы 100
				yn({ id = 'g001ig0133', min = 1, max = 1 }), -- Сфера Брони I +15брони-1 200
				yn({ id = 'g001ig0446', min = 1, max = 1 }), -- Сфера Вампиризма I +20вамп-1 200
				yn({ id = 'g000ig9017', min = 1, max = 1 }), -- Сфера Восстановления 30хил-аое 200
				yn({ id = 'g001ig0471', min = 1, max = 1 }), -- Сфера Охотника 40урона-1 200
				yn({ id = 'g001ig0464', min = 1, max = 1 }), -- Сфера Разрушения доспеха I -15брони-1 200
				yn({ id = 'g001ig0450', min = 1, max = 1 }), -- Сфера Урона I +20урон-1 200

				--знамя
				yn({ id = 'g000ig1001', min = 1, max = 1 }), -- знамя защиты400
				yn({ id = 'g001ig0051', min = 1, max = 1 }), -- знамя выносл400
				yn({ id = 'g000ig1007', min = 1, max = 1 }), -- знамя силы400
				yn({ id = 'g000ig1005', min = 1, max = 1 }), -- знамя быстроты400
				yn({ id = 'g000ig1003', min = 1, max = 1 }), -- знамя сражения400
				yn({ id = 'g001ig0370', min = 1, max = 1 }), -- Знамя искоренителя ереси600
				yn({ id = 'g001ig0369', min = 1, max = 1 }), -- Знамя снежной охоты600

				--талик
				{ id = getTalisman2(), min = 1, max = 1 }, -- Талисман Восстановления 400-500

				--свитки
				rnd({ id = 'g000ig5021', min = 1, max = 1}, { id = 'g000ig5003', min = 1, max = 1}, { id = 'g001ig0250', min = 1, max = 1}, { id = 'g000ig5023', min = 1, max = 1}), -- свиток л.щит, сила, с.кости, с.витара
				rnd({ id = 'g001ig0248', min = 1, max = 1}, { id = 'g000ig5045', min = 1, max = 1}, { id = 'g000ig5064', min = 1, max = 1}, { id = 'g000ig5101', min = 1, max = 1}), -- свиток устр. гимн, tormentio-броня, слабость, стая
				rnd({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
			}
		},
--класс			guard = guard1(),
	}
}
end

-- Лавка т2
function zoneMerch2() -- свитки 550
return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 1100, max = 1100 },
			itemValue = { min = 550, max = 550 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7}, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g001ig0180', min = 7, max = 10 },

				{ id = 'g000ig0002', min = 1, max = 1 }, --15з
				{ id = 'g000ig0014', min = 1, max = 2 }, --15а
				{ id = 'g000ig0011', min = 1, max = 1 }, --15и
				{ id = 'g000ig0008', min = 1, max = 2 }, --15т

				{ id = 'g000ig0021', min = 1, max = 1 }, -- вард в
				{ id = 'g000ig0022', min = 1, max = 2 }, -- вард в
				{ id = 'g000ig0023', min = 1, max = 2 }, -- вард з
				{ id = 'g000ig0024', min = 1, max = 1 }, -- вард о

				rnd({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти

				{ id = d15(), min = 1, max = 1 }, -- случ. дотвард

				{ id = 'g002ig0007', min = 1, max = 2 }, --Зелье магической устойчивости
				rnd({ id = 'g002ig0005', min = 1, max = 2 }, { id = 'g002ig0006', min = 1, max = 1 }), --Зелье наблюдательности / Зелье бдительности

				{ id = e4(), min = 1, max = 1},
				{ id = e4(), min = 1, max = 1},
				{ id = pw5(), min = 1, max = 1},

				rnd({ id = 'g001ig0534', min = 1, max = 1 }, { id = 'g001ig0519', min = 1, max = 1 }), -- Экстракт таинственной энергии (смена атаки) / Война престолов (-10 воры)
				rnd({ id = 'g000ig0004', min = 1, max = 1 }, { id = 'g001ig0028', min = 1, max = 1 }), -- эликсир твердости / аура выносл 5оз аое
				rnd({ id = 'g000ig0016', min = 1, max = 1 }, { id = 'g001ig0029', min = 1, max = 1 }), -- эликсир мощи +10атака / Аура силы +5атака аое

				{ id = perks_perm[1], min = 1, max = 1 }, -- Пермо на навык
				{ id = perks_perm[2], min = 1, max = 1 }, -- Пермо на навык

				{ id = rnd('g001ig0493', 'g001ig0494', 'g001ig0495'), min = 1, max = 1 }, -- Книга Божественных даров(артефакты) / Книга странника (сапоги) / Книга наследия (знамёна)

				yn({ id = 'g001ig0417', min = 1, max = 1 }), -- Руна верности Моккуркальфи (Артефакт) 800
				yn({ id = 'g001ig0045', min = 1, max = 1 }), -- кров.свят800
				yn({ id = 'g000ig3003', min = 1, max = 1 }), -- кол.силы800
				yn({ id = 'g001ig0042', min = 1, max = 1 }), -- клыки бездны800
				yn({ id = 'g001ig0047', min = 1, max = 1 }), -- рун.жизн800
				yn({ id = 'g001ig0196', min = 1, max = 1 }), -- рун.мол800
				yn({ id = 'g001ig0582', min = 1, max = 1 }), -- Камень врат (Артефакт)800
				yn({ id = 'g001ig0416', min = 1, max = 1 }), -- Руна предвидения Вотана (Артефакт) 800
				yn({ id = 'g001ig0589', min = 1, max = 1 }), -- Щит неведения (Артефакт) 800
				yn({ id = 'g001ig0040', min = 1, max = 1 }), -- пер.песк1000
				yn({ id = 'g001ig0657', min = 1, max = 1 }), -- Топор палача (Артефакт) 700

				yn({ id = 'g001ig0420', min = 1, max = 1 }), -- Вечные латы (Реликвия)800
				yn({ id = 'g001ig0424', min = 1, max = 1 }), -- Длани ангела (Реликвия) 750
				yn({ id = 'g001ig0422', min = 1, max = 1 }), -- Кровавый покров (Реликвия)700
				yn({ id = 'g000ig2006', min = 1, max = 1 }), -- таира чистоты800
				yn({ id = 'g001ig0427', min = 1, max = 1 }), -- Нагрудник Стража (Реликвия)600
				yn({ id = 'g001ig0423', min = 1, max = 1 }), -- Латы Спасителя (Реликвия)700
				yn({ id = 'g001ig0156', min = 1, max = 1 }), -- р.шкатулка800
				yn({ id = 'g002ig0002', min = 1, max = 1 }), -- Промасленная кольчуга (Реликвия) 700
				yn({ id = 'g001ig0602', min = 1, max = 1 }), -- Доспех жатвы (Реликвия)800

				rnd({ id = 'g001ig0114', min = 1, max = 1 }, { id = 'g001ig0111', min = 1, max = 1 }), -- сапоги тяж 500 / сапоги асс 500
				rnd({ id = 'g001ig0115', min = 1, max = 1 }, { id = 'g001ig0112', min = 1, max = 1 }), -- сапоги жел. поступь1100 / сапоги ангел800

				--посох
				rnd({ id = 'g001ig0406', min = 1, max = 1 }, { id = 'g001ig0392', min = 1, max = 1 }, { id = 'g001ig0380', min = 1, max = 1 }, { id = 'g000ig6021', min = 1, max = 1 }), -- Посох провидицы+вижн / Посох знаний Фрегги (40 хила) / Посох врат Бездны+белик / Посох Зов Леса+энт
				rnd({ id = 'g001ig0401', min = 1, max = 1 }, { id = 'g001ig0404', min = 1, max = 1 }, { id = 'g001ig0403', min = 1, max = 1 }, { id = 'g000ig6019', min = 1, max = 1 }), -- Посох проклятой метки-15урон / Посох Ниграэля-15урона / Посох неизбежной кары+15точность / Посох Листвы+деревья

				--сферы
				rnd({ id = 'g001ig0056', min = 1, max = 1 }, { id = 'g001ig0054', min = 1, max = 1 }, { id = 'g001ig0055', min = 1, max = 1 }, { id = 'g001ig0053', min = 1, max = 1 }), -- сфера защиты воды / воздуха / земли / огня
				yn({ id = 'g001ig0058', min = 1, max = 1 }), -- Сфера защиты от магии Разума 400
				yn({ id = 'g001ig0057', min = 1, max = 1 }), -- Сфера защиты от магии Смерти 400
				yn({ id = 'g001ig0187', min = 1, max = 1 }), -- Сфера Пламени 80урон 400
				yn({ id = 'g001ig0453', min = 1, max = 1 }), -- Сфера Святой земли 60хил-ряду 400
				yn({ id = 'g001ig0176', min = 1, max = 1 }), -- Сфера Вампиризма II 40-1 400
				yn({ id = 'g001ig0456', min = 1, max = 1 }), -- Сфера Прилива 80 400
				yn({ id = 'g001ig0496', min = 1, max = 1 }), -- Сфера Мучений 80 400
				yn({ id = 'g000ig9042', min = 1, max = 1 }), -- Сфера направленного ослабления I -33урон-1 400
				yn({ id = 'g001ig0475', min = 1, max = 1 }), -- Сфера Обширной коррозии I-10броня-аое 400
				yn({ id = 'g000ig9018', min = 1, max = 1 }), -- Сфера Прорицательницы 55хил аое 400
				yn({ id = 'g001ig0134', min = 1, max = 1 }), -- Сфера Урона II +40урон-1 400
				yn({ id = 'g001ig0191', min = 1, max = 1 }), -- Сфера Вампира 70 400
				yn({ id = 'g001ig0474', min = 1, max = 1 }), -- Сфера Скалы 80урон-1 400
				yn({ id = 'g001ig0461', min = 1, max = 1 }), -- Сфера Массового ослабления I -33урон аое 400
				yn({ id = 'g001ig0479', min = 1, max = 1 }), -- Сфера Разрушения доспеха II -30брони-1 400
				yn({ id = 'g001ig0454', min = 1, max = 1 }), -- Сфера Помощи 75хил 2x2 400
				yn({ id = 'g001ig0295', min = 1, max = 1 }), -- Сфера Замедления 50-1 400

				--знамя
				yn({ id = 'g001ig0289', min = 1, max = 1 }), -- знамя гор.стр700
				yn({ id = 'g000ig1006', min = 1, max = 1 }), -- знамя скорости700
				yn({ id = 'g000ig1008', min = 1, max = 1 }), -- знамя энерг700
				yn({ id = 'g001ig0293', min = 1, max = 1 }), -- знамя бан.неуд700
				yn({ id = 'g001ig0292', min = 1, max = 1 }), -- знамя стяг.конц700
				yn({ id = 'g001ig0361', min = 1, max = 1 }), -- Знамя горна700
				yn({ id = 'g001ig0357', min = 1, max = 1 }), -- Знамя неистовства700
				yn({ id = 'g001ig0373', min = 1, max = 1 }), -- Знамя магического иммунитета600
				yn({ id = rnd('g001ig0142','g001ig0140','g001ig0141','g001ig0139'), min = 1, max = 1 }), -- Знамя магии Воды / Воздуха / Земли / Огня700

				--талик
				{ id = getTalisman3(), min = 1, max = 1 }, -- Талисман Восстановления 600-800

				--свитки
				rnd({ id = 'g000ig5050', min = 1, max = 1}, { id = 'g001ig0253', min = 1, max = 1}, { id = 'g001ig0255', min = 1, max = 1}, { id = 'g001ig0256', min = 1, max = 1}), -- Свиток "Chronos"-ини, прокл.эмира-урон, спеш.время+ини, могущество+урон
				rnd({ id = 'g000ig5103', min = 1, max = 1}, { id = 'g000ig5030', min = 1, max = 1}, { id = 'g000ig5104', min = 1, max = 1}, { id = 'g001ig0085', min = 1, max = 1}), -- Свиток "Призыв II: Энт" / Свиток "Взгляд Сивиллы"+7x7карта / Свиток "Опаление"-25дмг / Свиток "Потоп"
				rnd({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
			}
		},
--класс		guard = guard2(),
	},
}
end

-- Лавка т3
function merchZone31()
	return {
			itemTypes = { Item.Scroll },
			value = { min = 1400, max = 1400 },
			itemValue = { min = 700, max = 700 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7 }, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g000ig0018', min = 1, max = 1 },

				{ id = 'g000ig0012', min = 1, max = 2 }, --ини30
				{ id = 'g000ig0015', min = 1, max = 2 }, --урон30
				{ id = 'g000ig0003', min = 1, max = 1 }, --защита30
				yn({ id = 'g000ig0009', min = 1, max = 1 }), --точность30

				yn({ id = 'g000ig0002', min = 1, max = 2 }), --защита15
				yn({ id = 'g000ig0014', min = 1, max = 2 }), --атака15
				yn({ id = 'g000ig0011', min = 1, max = 2 }), --ини15
				yn({ id = 'g000ig0008', min = 1, max = 2 }), --точность15

				yn({ id = 'g000ig0021', min = 1, max = 2 }), -- вард воздух
				yn({ id = 'g000ig0022', min = 1, max = 2 }), -- вард вода
				yn({ id = 'g000ig0023', min = 1, max = 2 }), -- вард земля
				yn({ id = 'g000ig0024', min = 1, max = 2 }), -- вард огонь

				yn({ id = 'g001ig0125', min = 1, max = 1 }), -- вард разума
				yn({ id = 'g001ig0036', min = 1, max = 1 }), -- вард смерти

				{ id = 'g002ig0007', min = 1, max = 2 }, --Зелье магической устойчивости
				rnd({ id = 'g002ig0005', min = 1, max = 2 }, { id = 'g002ig0006', min = 1, max = 1 }), --Зелье наблюдательности / Зелье бдительности

				{ id = pw5(), min = 1, max = 1},
				{ id = pw5(), min = 1, max = 1},
				{ id = pw6(), min = 1, max = 1},

				rnd({ id = 'g001ig0019', min = 1, max = 1 }, { id = 'g001ig0506', min = 1, max = 1 }), -- аое Малая аура вампиризма +10вамп / Настойка оратора +1лидер
				{ id = p15(), min = 1, max = 1},

				yn({ id = 'g001ig0591', min = 1, max = 1 }), -- Щит отражения (Артефакт) 900
				yn({ id = 'g000ig2004', min = 1, max = 1 }), -- рог.всев1200
				yn({ id = 'g000ig9137', min = 1, max = 1 }), -- серд.эмира1200
				yn({ id = 'g000ig3019', min = 1, max = 1 }), -- Клинок Танатоса (Артефакт) 1150
				yn({ id = 'g001ig0071', min = 1, max = 1 }), -- Эльфийская брошь (Артефакт) 1000
				yn({ id = 'g001ig0488', min = 1, max = 1 }), -- Кольцо Несгибаемого стража (Артефакт) 1000
				yn({ id = 'g001ig0590', min = 1, max = 1 }), -- Щит Мизраэля (Артефакт) 1200
				yn({ id = 'g001ig0603', min = 1, max = 1 }), -- Чаша жатвы (Артефакт) 1000
				yn({ id = 'g001ig0585', min = 1, max = 1 }), -- Кольцо создателя (Артефакт)1400
				yn({ id = 'g001ig0060', min = 1, max = 1 }), -- Тысяча чешуек (Артефакт) 1200
				yn({ id = 'g001ig0410', min = 1, max = 1 }), -- Дьявольская булава (Артефакт)1500
				yn({ id = 'g000ig2005', min = 1, max = 1 }), -- Гравированная диадема (Артефакт)1800
				yn({ id = 'g002ig0011', min = 1, max = 1 }), -- Щит рыцаря Феникса (Артефакт) 2400
				yn({ id = 'g002ig0013', min = 1, max = 1 }), -- Серп Кровавого Ворона (Артефакт) 1450

				yn({ id = 'g001ig0597', min = 1, max = 1 }), -- Кираса резонанса (Реликвия)1000
				yn({ id = 'g001ig0419', min = 1, max = 1 }), -- Шлем воителя (Реликвия)1000
				yn({ id = 'g001ig0430', min = 1, max = 1 }), -- Роба убийцы (Реликвия)850
				yn({ id = 'g001ig0539', min = 1, max = 1 }), -- Тисовый лук (Реликвия)900
				yn({ id = 'g001ig0116', min = 1, max = 1 }), -- р.плас.досп1200
				yn({ id = 'g000ig3005', min = 1, max = 1 }), -- р.кор.мьолн1200
				yn({ id = 'g000ig7010', min = 1, max = 1 }), -- р.кор.имп1800
				yn({ id = 'g001ig0038', min = 1, max = 1 }), -- р.тяж.латы1550
				yn({ id = 'g002ig0015', min = 1, max = 1 }), -- Кираса Кровавого Ворона (Реликвия) 1500

				rnd({ id = 'g001ig0501', min = 1, max = 1 }, { id = 'g000ig1010', min = 1, max = 1 }), -- Дары Галлеана (лес) 900 / эльфийские сапоги 700
				rnd({ id = 'g000ig8003', min = 1, max = 1 }, { id = 'g001ig0606', min = 1, max = 1 }), -- Сапоги скорости 700 | Сапоги родных земель 1000

				--посох
				rnd({ id = 'g000ig6020', min = 1, max = 1 }, { id = 'g000ig6014', min = 1, max = 1 }, { id = 'g001ig0391', min = 1, max = 1 }), -- Посох Возни-15точ-10урон / Посох защиты+15броня / Посох оракула+60оз
				rnd({ id = 'g000ig6016', min = 1, max = 1 }, { id = 'g000ig6018', min = 1, max = 1 }, { id = 'g001ig0097', min = 1, max = 1 }), -- Посох бури=40дмг / Посох сумерек-вижн / Посох озер+вода

				--сферы
				yn({ id = 'g001ig0478', min = 1, max = 1 }), -- Сфера Переохлаждения 40мороз непр. 500
				yn({ id = 'g001ig0467', min = 1, max = 1 }), -- Сфера Бури 66 2x2 500
				yn({ id = 'g000ig9024', min = 1, max = 1 }), -- Сфера Жажды 45вамп 500
				yn({ id = 'g000ig9020', min = 1, max = 1 }), -- Сфера Энергии +25аоеурон 500
				yn({ id = 'g000ig9021', min = 1, max = 1 }), -- Сфера Вампиризма III 60 700
				yn({ id = 'g000ig9016', min = 1, max = 1 }), -- Сфера Великого исцеления 80 700
				yn({ id = 'g001ig0203', min = 1, max = 1 }), -- Сфера Массового ослабления II 50 700
				yn({ id = 'g001ig0466', min = 1, max = 1 }), -- Сфера Морской пучины 110урон 700
				yn({ id = 'g001ig0457', min = 1, max = 1 }), -- Сфера Испепеления 110урон 700
				yn({ id = 'g001ig0183', min = 1, max = 1 }), -- Сфера Обширной коррозии II -20брони аое 700
				yn({ id = 'g001ig0480', min = 1, max = 1 }), -- Сфера Горы урон110 800
				yn({ id = 'g001ig0059', min = 1, max = 1 }), -- Сфера защиты от Оружия 800
				yn({ id = 'g000ig9025', min = 1, max = 1 }), -- Сфера Алчности 60 вамп аое 900
				yn({ id = 'g001ig0459', min = 1, max = 1 }), -- Сфера Землетрясения 75 колонны 900
				yn({ id = 'g000ig9014', min = 1, max = 1 }), -- Сфера Массового замедления 50 1000

				--знамя
				yn({ id = 'g000ig1002', min = 1, max = 1 }), -- знамя неуязв700
				yn({ id = 'g001ig0362', min = 1, max = 1 }), -- Знамя болот800
				yn({ id = 'g001ig0363', min = 1, max = 1 }), -- Знамя отваги750
				yn({ id = 'g001ig0374', min = 1, max = 1 }), -- Знамя стального листопада800
				yn({ id = 'g001ig0364', min = 1, max = 1 }), -- Знамя ветра перемен800
				yn({ id = 'g001ig0358', min = 1, max = 1 }), -- Знамя ража800
				yn({ id = 'g001ig0375', min = 1, max = 1 }), -- Знамя наследия1000
				yn({ id = 'g001ig0291', min = 1, max = 1 }), -- Штандарт равновесия1500
				yn({ id = 'g001ig0290', min = 1, max = 1 }), -- Стяг непреклонности1500
				yn({ id = 'g001ig0052', min = 1, max = 1 }), -- Знамя стойких1500
				yn({ id = 'g000ig1017', min = 1, max = 1 }), -- Знамя Здоровья1500
				yn({ id = 'g002ig0016', min = 1, max = 1 }), -- Стяг Кровавого Ворона1800

				--талик
				{ id = rnd(getTalisman4(), getTalisman5()), min = 1, max = 1 }, -- Талисман 1000 / 1200-1800

				--свитки
				rnd({ id = 'g000ig5110', min = 1, max = 1}, { id = 'g000ig5109', min = 1, max = 1}, { id = 'g001ig0165', min = 1, max = 1}, { id = 'g000ig5108', min = 1, max = 1}), -- Свиток "Излечение" / Свиток "Блуждающий Огонек"-40дмг / Свиток "Забвение"-перки / Свиток "Призыв III: Энт Большой"
				rnd({ id = 'g000ig5089', min = 1, max = 1}, { id = 'g000ig5026', min = 1, max = 1}, { id = 'g000ig5013', min = 1, max = 1}, { id = 'g000ig5012', min = 1, max = 1}), -- Свиток "Preces"-точн.урон / Свиток "Гимн кланов"+ини / Свиток "Святая сила"+точн.урон / Свиток "Святая броня"+броня
			}
		}
end

function merchZone32()
return {
			itemTypes = { Item.Scroll },
			value = { min = 1400, max = 1400 },
			itemValue = { min = 700, max = 700 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7 }, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g000ig0018', min = 1, max = 1 },

				{ id = 'g000ig0012', min = 1, max = 1 }, --ини30
				{ id = 'g000ig0015', min = 1, max = 1 }, --урон30
				{ id = 'g000ig0003', min = 1, max = 2 }, --защита30
				yn({ id = 'g000ig0009', min = 1, max = 1 }), --точность30

				yn({ id = 'g000ig0002', min = 1, max = 2 }), --защита15
				yn({ id = 'g000ig0014', min = 1, max = 2 }), --атака15
				yn({ id = 'g000ig0011', min = 1, max = 2 }), --ини15
				yn({ id = 'g000ig0008', min = 1, max = 2 }), --точность15

				yn({ id = 'g000ig0021', min = 1, max = 2 }), -- вард воздух
				yn({ id = 'g000ig0022', min = 1, max = 2 }), -- вард вода
				yn({ id = 'g000ig0023', min = 1, max = 2 }), -- вард земля
				yn({ id = 'g000ig0024', min = 1, max = 2 }), -- вард огонь

				yn({ id = 'g001ig0125', min = 1, max = 1 }), -- вард разума
				yn({ id = 'g001ig0036', min = 1, max = 1 }), -- вард смерти

				{ id = 'g002ig0007', min = 1, max = 2 }, --Зелье магической устойчивости
				rnd({ id = 'g002ig0005', min = 1, max = 2 }, { id = 'g002ig0006', min = 1, max = 1 }), --Зелье наблюдательности / Зелье бдительности

				{ id = pw5(), min = 1, max = 1},
				{ id = pw5(), min = 1, max = 1},
				{ id = pw6(), min = 1, max = 1},

				rnd({ id = 'g001ig0563', min = 1, max = 1 }, { id = 'g001ig0035', min = 1, max = 1 }), -- Аура внимательности +5 крит / Великая аура жизненной силы аое +30хп
				{ id = p15(), min = 1, max = 1},

				yn({ id = 'g001ig0197', min = 1, max = 1 }), -- прокл.пепел950
				yn({ id = 'g000ig3004', min = 1, max = 1 }), -- рун.клин1200
				yn({ id = 'g001ig0124', min = 1, max = 1 }), -- клин.возв1200
				yn({ id = 'g000ig9035', min = 1, max = 1 }), -- Слеза Мортис (Артефакт) 1200
				yn({ id = 'g001ig0415', min = 1, max = 1 }), -- Руна кары Тьяцци (Артефакт) 1150
				yn({ id = 'g001ig0612', min = 1, max = 1 }), -- Кольцо небесной воли (Артефакт) 1000
				yn({ id = 'g001ig0413', min = 1, max = 1 }), -- Корни триббога (Артефакт) 1200
				yn({ id = 'g001ig0411', min = 1, max = 1 }), -- Грань реальности (Артефакт)1400
				yn({ id = 'g001ig0604', min = 1, max = 1 }), -- Кинжал жатвы (Артефакт)1300
				yn({ id = 'g001ig0046', min = 1, max = 1 }), -- Кровь Владыки (Артефакт)1400
				yn({ id = 'g001ig0102', min = 1, max = 1 }), -- Коготь Пожирателя (Артефакт)1800
				yn({ id = 'g002ig0010', min = 1, max = 1 }), -- Меч рыцаря Феникса (Артефакт) 2250
				yn({ id = 'g002ig0014', min = 1, max = 1 }), -- Кама Кровавого Ворона (Артефакт) 1750
				yn({ id = 'g002ig0017', min = 1, max = 1 }), -- Копье Ангела (Артефакт) 1750

				yn({ id = 'g001ig0597', min = 1, max = 1 }), -- Кираса резонанса (Реликвия)1000
				yn({ id = 'g001ig0419', min = 1, max = 1 }), -- Шлем воителя (Реликвия)1000
				yn({ id = 'g001ig0430', min = 1, max = 1 }), -- Роба убийцы (Реликвия)850
				yn({ id = 'g001ig0539', min = 1, max = 1 }), -- Тисовый лук (Реликвия)900
				yn({ id = 'g001ig0116', min = 1, max = 1 }), -- р.плас.досп1200
				yn({ id = 'g000ig3005', min = 1, max = 1 }), -- р.кор.мьолн1200
				yn({ id = 'g000ig7010', min = 1, max = 1 }), -- р.кор.имп1800
				yn({ id = 'g001ig0038', min = 1, max = 1 }), -- р.тяж.латы1550
				yn({ id = 'g002ig0012', min = 1, max = 1 }), -- Доспех рыцаря Феникса (Реликвия) 2600

				rnd({ id = 'g001ig0501', min = 1, max = 1 }, { id = 'g000ig1010', min = 1, max = 1 }), -- Дары Галлеана (лес) 900 / эльфийские сапоги 700
				rnd({ id = 'g000ig8003', min = 1, max = 1 }, { id = 'g001ig0606', min = 1, max = 1 }), -- Сапоги скорости 700 | Сапоги родных земель 1000

				--посох
				rnd({ id = 'g000ig6011', min = 1, max = 1 }, { id = 'g001ig0398', min = 1, max = 1 }, { id = 'g001ig0400', min = 1, max = 1 }), -- Посох повелителя драконов=40дмг / Посох скальда+15ини / Посох созыва шабаша-вижн
				rnd({ id = 'g000ig6015', min = 1, max = 1 }, { id = 'g000ig6017', min = 1, max = 1 }, { id = 'g000ig6009', min = 1, max = 1 }), -- Посох Всевышнего+20хп+5брони / Посох дневного света+вижн / Посох земли+голем

				--сферы
				yn({ id = 'g001ig0469', min = 1, max = 1 }), -- Сфера Пожара 55крест 500
				yn({ id = 'g001ig0304', min = 1, max = 1 }), -- Сфера Боли 60 ряд 500
				yn({ id = 'g001ig0468', min = 1, max = 1 }), -- Сфера Оползня 50урон 2колоны 500
				yn({ id = 'g001ig0443', min = 1, max = 1 }), -- Сфера Брони II 25 600
				yn({ id = 'g001ig0462', min = 1, max = 1 }), -- Сфера направленного ослабления II 50 700
				yn({ id = 'g001ig0455', min = 1, max = 1 }), -- Сфера Спасения 100хил 2колонны 700
				yn({ id = 'g001ig0489', min = 1, max = 1 }), -- Сфера Угнетения 110 урон 700
				yn({ id = 'g001ig0131', min = 1, max = 1 }), -- Сфера Урона III +урон60 700
				yn({ id = 'g000ig9028', min = 1, max = 1 }), -- Сфера Грозы 110урон 700
				yn({ id = 'g001ig0136', min = 1, max = 1 }), -- Сфера Брони III 35 800
				yn({ id = 'g001ig0303', min = 1, max = 1 }), -- Сфера Древнего вамп100 800
				yn({ id = 'g001ig0477', min = 1, max = 1 }), -- Сфера Терзаний 85 ряд 900
				yn({ id = 'g000ig9027', min = 1, max = 1 }), -- Сфера Урагана 99 2x2 900
				yn({ id = 'g000ig9032', min = 1, max = 1 }), -- Сфера цунами 90 неприкр 900

				--знамя
				yn({ id = 'g000ig1002', min = 1, max = 1 }), -- знамя неуязв700
				yn({ id = 'g001ig0362', min = 1, max = 1 }), -- Знамя болот800
				yn({ id = 'g001ig0363', min = 1, max = 1 }), -- Знамя отваги750
				yn({ id = 'g001ig0374', min = 1, max = 1 }), -- Знамя стального листопада800
				yn({ id = 'g001ig0364', min = 1, max = 1 }), -- Знамя ветра перемен800
				yn({ id = 'g001ig0358', min = 1, max = 1 }), -- Знамя ража800
				yn({ id = 'g001ig0375', min = 1, max = 1 }), -- Знамя наследия1000
				yn({ id = 'g001ig0291', min = 1, max = 1 }), -- Штандарт равновесия1500
				yn({ id = 'g001ig0290', min = 1, max = 1 }), -- Стяг непреклонности1500
				yn({ id = 'g001ig0052', min = 1, max = 1 }), -- Знамя стойких1500
				yn({ id = 'g000ig1017', min = 1, max = 1 }), -- Знамя Здоровья1500
				yn({ id = 'g002ig0016', min = 1, max = 1 }), -- Стяг Кровавого Ворона1800

				--талик
				{ id = rnd(getTalisman4(), getTalisman5()), min = 1, max = 1 }, -- Талисман 1000 / 1200-1800

				--свитки
				rnd({ id = 'g000ig5110', min = 1, max = 1}, { id = 'g000ig5109', min = 1, max = 1}, { id = 'g001ig0165', min = 1, max = 1}, { id = 'g000ig5108', min = 1, max = 1}), -- Свиток "Излечение" / Свиток "Блуждающий Огонек"-40дмг / Свиток "Забвение"-перки / Свиток "Призыв III: Энт Большой"
				rnd({ id = 'g000ig5089', min = 1, max = 1}, { id = 'g000ig5026', min = 1, max = 1}, { id = 'g000ig5013', min = 1, max = 1}, { id = 'g000ig5012', min = 1, max = 1}), -- Свиток "Preces"-точн.урон / Свиток "Гимн кланов"+ини / Свиток "Святая сила"+точн.урон / Свиток "Святая броня"+броня

			}
		}
end

function zoneMerchZone3(merch_id)
	if merch_id == 1 then
		return {
			{
				name = merchant_c_data[merch_id].name,
				description = merchant_c_data[merch_id].description,
				goods = merchZone31()
			}
		}
	elseif merch_id == 2 then
		return {
			{
				name = merchant_c_data[merch_id].name,
				description = merchant_c_data[merch_id].description,
				goods = merchZone32()
			}
		}
	end
end


----------------------

-- Руины Респ 0
function z0Ruins()
local valueRuinRespZ0 = { min = 160, max = 160*kr }
return {
	{
		gold = { min = 250, max = 300 },
		loot = {
			items = {
				{id = ruin01(), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = valueRuinRespZ0
		}
	},
-- вторые р
	{
		gold = { min = 200, max = 250 },
		loot = {
			items = {
				{id = ruin02(), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = valueRuinRespZ0
		}
	},

}
end

-- Руины зона 1
function zoneRuinRespZ()
local valueRuinRespZ = { min = 240*kef, max = 240*kef*kr }
local goldRuinRespZ = { min = 300, max = 350 }
return {
	{
		gold = goldRuinRespZ,
		loot = {
			items = {
				{id = ruin1(), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = valueRuinRespZ
		}
	},
}
end


-- Руины зона 2
function zoneRuinZone2()
local valueRuinZone = { min = 400*kef, max = 400*kef*kr }
local goldRuinZone = { min = 350, max = 400 }
return {
	{
		gold = goldRuinZone,
		loot = {
			itemTypes = { Item.Talisman, Item.Armor, Item.Jewel, Item.Weapon, Item.Banner, Item.TravelItem},
			value = { min = 700, max = 800 },
			itemValue = { min = 700, max = 800 }
		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone
		}
	},
}
end


-- Руины зона 3
function zoneRuinZone3(rid1, rid2)
local valueRuinZone3 = { min = 900*kef, max = 900*kef*kr }
local goldRuinZone3 = { min = 400, max = 450 }
	local ruins = {}
	if rid1 == 1 or rid2 == 1 then
		table.insert(ruins, {
			name = ruins_c_data[1],
			gold = goldRuinZone3,
			loot = {
					itemTypes = { Item.Armor }, -- 12 итемов
					value = { min = 900, max = 1200 },
					itemValue = { min = 900, max = 1200 }
			},
			guard = {
				subraceTypes = NoUndead(),
				value = valueRuinZone3
			}
		})
	end
	if rid1 == 2 or rid2 == 2 then
		table.insert(ruins, {
			name = ruins_c_data[2],
			gold = goldRuinZone3,
			loot = {
					itemTypes = { Item.Weapon }, -- 9 итемов
					value = { min = 900, max = 1200 },
					itemValue = { min = 900, max = 1200 }
			},
			guard = {
				subraceTypes = NoUndead(),
				value = valueRuinZone3
			}
		})
	end
	if rid1 == 3 or rid2 == 3 then
		table.insert(ruins, {
			name = ruins_c_data[3],
			gold = goldRuinZone3,
			loot = {
					itemTypes = { Item.Jewel, Item.Talisman }, -- 7 + 4 итемов
					value = { min = 900, max = 1200 },
					itemValue = { min = 900, max = 1200 }
			},
			guard = {
				subraceTypes = NoUndead(),
				value = valueRuinZone3
			}
		})
	end
	if rid1 == 4 or rid2 == 4 then
		table.insert(ruins, {
			name = ruins_c_data[4],
			gold = goldRuinZone3,
			loot = {
					itemTypes = { Item.Banner }, -- 8 итемов
					value = { min = 800, max = 1000 },
					itemValue = { min = 800, max = 1200 }
			},
			guard = {
				subraceTypes = NoUndead(),
				value = valueRuinZone3
			}
		})
	end

	return ruins
end

function zoneRuinZone4()
local valueRuinZone4 = { min = 1400*kef, max = 1500*kef }
return {
	{
		name = ruins_t_data[1],
		gold = { min = 480, max = 540 },
		loot = {
			items = {
				-- Божественный потир (Артефакт) / Грань реальности (Артефакт) / Дьявольская булава (Артефакт) / Клинок Танатоса (Артефакт) / Корни триббога (Артефакт) / Руна кары Тьяцци (Артефакт) / Рунический клинок (Артефакт) / Серп Кровавого Ворона (Артефакт) / Слеза Мортис (Артефакт) / Талисман 1200-1800
				{id = rnd('g001ig0174','g001ig0411','g001ig0410','g000ig3019','g001ig0413','g001ig0415','g000ig3004','g002ig0013','g000ig9035',getTalisman5()), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone4
		}
	},
	{
		name = ruins_t_data[2],
		gold = { min = 480, max = 540 },
		loot = {
			items = {
				-- Кинжал жатвы (Артефакт) / Кольцо создателя (Артефакт) / Кровь Владыки (Артефакт) / Монолитный щит (Артефакт) / Рог всеведенья (Артефакт) / Тысяча чешуек (Артефакт) / Щит Мизраэля (Артефакт) / Кираса Кровавого Ворона (Реликвия) / Корона Мьольнира (Реликвия) / Пластинчатый доспех (Реликвия)
				{id = rnd('g001ig0604','g001ig0585','g001ig0046','g001ig0592','g000ig2004','g001ig0060','g001ig0590','g002ig0015','g000ig3005','g001ig0116'), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone4
		}
	},
}
end

---------------------

-- Обменник союзников
function rMarketsZone0()
return {
{
	exchangeRates = [[
		function getExchangeRates(visitor)
				local k1 = 1
				local k2 = 25
			return {
				{
					Resource.Gold,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.LifeMana,
					{
					{ Resource.Gold, k2, k1 },
					{ Resource.DeathMana, k2, k2 },
					{ Resource.RunicMana, k2, k2 },
					{ Resource.InfernalMana, k2, k2 },
					{ Resource.GroveMana, k2, k2 }
					}
				},
				{
					Resource.DeathMana,
					{
					{ Resource.LifeMana, k2, k2 },
					{ Resource.Gold, k2, k1 },
					{ Resource.RunicMana, k2, k2 },
					{ Resource.InfernalMana, k2, k2 },
					{ Resource.GroveMana, k2, k2 }
					}
				},
				{
					Resource.RunicMana,
					{
					{ Resource.LifeMana, k2, k2 },
					{ Resource.DeathMana, k2, k2 },
					{ Resource.Gold, k2, k1 },
					{ Resource.InfernalMana, k2, k2 },
					{ Resource.GroveMana, k2, k2 }
					}
				},
				{
					Resource.InfernalMana,
					{
					{ Resource.LifeMana, k2, k2 },
					{ Resource.DeathMana, k2, k2 },
					{ Resource.RunicMana, k2, k2 },
					{ Resource.Gold, k2, k1 },
					{ Resource.GroveMana, k2, k2 }
					}
				},
				{
					Resource.GroveMana,
					{
					{ Resource.LifeMana, k2, k2 },
					{ Resource.DeathMana, k2, k2 },
					{ Resource.RunicMana, k2, k2 },
					{ Resource.InfernalMana, k2, k2 },
					{ Resource.Gold, k2, k1 }
					}
				},
			}
		end
]],


    stock = {
		{resource = Resource.Gold, value = { min = 322, max = 322 }},
		{resource = Resource.LifeMana, value = { min = 0, max = 0 }},
		{resource = Resource.DeathMana, value = { min = 0, max = 0 }},
		{resource = Resource.InfernalMana, value = { min = 0, max = 0 }},
        {resource = Resource.RunicMana, value = { min = 0, max = 0 }},
        {resource = Resource.GroveMana, value = { min = 0, max = 0 }}
    }
}
}
end

-- Обменник центр
function rMarketsZone3()
return {
{
	exchangeRates = [[
		function getExchangeRates(visitor)
				local k1 = 3
				local k2 = 1
			return {
				{
					Resource.Gold,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.LifeMana,
					{
					{ Resource.Gold, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.DeathMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.RunicMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.InfernalMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.GroveMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.Gold, k1, k2 }
					}
				},
			}
		end
]],


    stock = {
		{resource = Resource.Gold, value = { min = 1500, max = 1500 }},
		{resource = Resource.LifeMana, value = { min = 500, max = 500 }},
		{resource = Resource.DeathMana, value = { min = 500, max = 500 }},
		{resource = Resource.InfernalMana, value = { min = 500, max = 500 }},
        {resource = Resource.RunicMana, value = { min = 500, max = 500 }},
        {resource = Resource.GroveMana, value = { min = 500, max = 500 }}
    },
	name = market_c_data[1].name,
	description = market_c_data[1].description
}
}
end

---------------------

-- Источники Респ
function getMinesRespZ(race)
	local mines = gmm(
		{	-- FFA: 3 = 1 золото, 1 родная мана, 1 "важная" мана
			[Race.Human] = { gold = 1, lifeMana = 1, runicMana = mines1[1], deathMana = 0, infernalMana = 0, groveMana = mines1[2] },
			[Race.Dwarf] = { gold = 1, lifeMana = mines1[1], runicMana = 1, deathMana = 0, infernalMana = 0, groveMana = mines1[2] },
			[Race.Undead] = { gold = 1, lifeMana = 0, runicMana = 0, deathMana = 1, infernalMana = mines1[1], groveMana = mines1[2] },
			[Race.Heretic] = { gold = 1, lifeMana = 0, runicMana = 0, deathMana = mines1[1], infernalMana = 1, groveMana = mines1[2] },
			[Race.Elf] = { gold = 1, lifeMana = mines1[1], runicMana = 0, deathMana = 0, infernalMana = mines1[2], groveMana = 1 }
		},
		{	-- 2x2 T0: 4 = 1 золото, 1 родная мана, 1 "важная" мана, 1 "неважная" мана
			[Race.Human] = { gold = 1, lifeMana = 1, runicMana = mines1[1], deathMana = mines2[1], infernalMana = mines2[2], groveMana = mines1[2] },
			[Race.Dwarf] = { gold = 1, lifeMana = mines1[1], runicMana = 1, deathMana = mines2[1], infernalMana = mines2[2], groveMana = mines1[2] },
			[Race.Undead] = { gold = 1, lifeMana = mines2[1], runicMana = mines2[2], deathMana = 1, infernalMana = mines1[1], groveMana = mines1[2] },
			[Race.Heretic] = { gold = 1, lifeMana = mines2[1], runicMana = mines2[2], deathMana = mines1[1], infernalMana = 1, groveMana = mines1[2] },
			[Race.Elf] = { gold = 1, lifeMana = mines1[1], runicMana = mines2[1], deathMana = mines2[2], infernalMana = mines1[2], groveMana = 1 }
		},
		{	-- 2x2 T2: 3 = 1 золото, 1 родная мана, 1 "важная" мана
			[Race.Human] = { gold = 1, lifeMana = 1, runicMana = mines1[1], deathMana = 0, infernalMana = 0, groveMana = mines1[2] },
			[Race.Dwarf] = { gold = 1, lifeMana = mines1[1], runicMana = 1, deathMana = 0, infernalMana = 0, groveMana = mines1[2] },
			[Race.Undead] = { gold = 1, lifeMana = 0, runicMana = 0, deathMana = 1, infernalMana = mines1[1], groveMana = mines1[2] },
			[Race.Heretic] = { gold = 1, lifeMana = 0, runicMana = 0, deathMana = mines1[1], infernalMana = 1, groveMana = mines1[2] },
			[Race.Elf] = { gold = 1, lifeMana = mines1[1], runicMana = 0, deathMana = 0, infernalMana = mines1[2], groveMana = 1 }
		}
	)
	return mines[race]
end

-- Источники т1
function getMinesRespZ2(race)
	local mines = gmm(
		{ -- FFA: 4 = 1 золото, 1 родная мана, 1 "важная" мана, 1 "неважная" мана
			[Race.Human] = { gold = 1, lifeMana = 1, runicMana = mines1[2], deathMana = mines2[1], infernalMana = mines2[2], groveMana = mines1[1] },
			[Race.Dwarf] = { gold = 1, lifeMana = mines1[2], runicMana = 1, deathMana = mines2[1], infernalMana = mines2[2], groveMana = mines1[1] },
			[Race.Undead] = { gold = 1, lifeMana = mines2[1], runicMana = mines2[2], deathMana = 1, infernalMana = mines1[2], groveMana = mines1[1] },
			[Race.Heretic] = { gold = 1, lifeMana = mines2[1], runicMana = mines2[2], deathMana = mines1[2], infernalMana = 1, groveMana = mines1[1] },
			[Race.Elf] = { gold = 1, lifeMana = mines1[2], runicMana = mines2[1], deathMana = mines2[2], infernalMana = mines1[1], groveMana = 1 }
		},
		{	-- 2x2 T0: 3 = 1 золото, 1 родная мана, 1 "важная" мана
			[Race.Human] = { gold = 1, lifeMana = 1, runicMana = mines1[2], deathMana = 0, infernalMana = 0, groveMana = mines1[1] },
			[Race.Dwarf] = { gold = 1, lifeMana = mines1[2], runicMana = 1, deathMana = 0, infernalMana = 0, groveMana = mines1[1] },
			[Race.Undead] = { gold = 1, lifeMana = 0, runicMana = 0, deathMana = 1, infernalMana = mines1[2], groveMana = mines1[1] },
			[Race.Heretic] = { gold = 1, lifeMana = 0, runicMana = 0, deathMana = mines1[2], infernalMana = 1, groveMana = mines1[1] },
			[Race.Elf] = { gold = 1, lifeMana = mines1[2], runicMana = 0, deathMana = 0, infernalMana = mines1[1], groveMana = 1 }
		},
		{	-- 2x2 T2: 3 = 1 золото, 1 родная мана, 1 "неважная" мана
			[Race.Human] = { gold = 1, lifeMana = 1, runicMana = 0, deathMana = mines2[1], infernalMana = mines2[2], groveMana = 0 },
			[Race.Dwarf] = { gold = 1, lifeMana = 0, runicMana = 1, deathMana = mines2[1], infernalMana = mines2[2], groveMana = 0 },
			[Race.Undead] = { gold = 1, lifeMana = mines2[1], runicMana = mines2[2], deathMana = 1, infernalMana = 0, groveMana = 0 },
			[Race.Heretic] = { gold = 1, lifeMana = mines2[1], runicMana = mines2[2], deathMana = 0, infernalMana = 1, groveMana = 0 },
			[Race.Elf] = { gold = 1, lifeMana = 0, runicMana = mines2[1], deathMana = mines2[2], infernalMana = 0, groveMana = 1 }
		}
	)
	return mines[race]
end

-- Источники т2
function getMinesZone2(race)
	local mines = gmm(
		{	-- FFA: 2 = 1 золото, 1 "неважная" мана
			[Race.Human] = { gold = 1, lifeMana = 0, runicMana = 0, deathMana = mines2[2], infernalMana = mines2[1], groveMana = 0 },
			[Race.Dwarf] = { gold = 1, lifeMana = 0, runicMana = 0, deathMana = mines2[2], infernalMana = mines2[1], groveMana = 0 },
			[Race.Undead] = { gold = 1, lifeMana = mines2[2], runicMana = mines2[1], deathMana = 0, infernalMana = 0, groveMana = 0 },
			[Race.Heretic] = { gold = 1, lifeMana = mines2[2], runicMana = mines2[1], deathMana = 0, infernalMana = 0, groveMana = 0 },
			[Race.Elf] = { gold = 1, lifeMana = 0, runicMana = mines2[2], deathMana = mines2[1], infernalMana = 0, groveMana = 0 },
		},
		{	-- 2x2 T0: 2 = 1 золото, 1 "неважная" мана
			[Race.Human] = { gold = 1, lifeMana = 0, runicMana = 0, deathMana = mines2[2], infernalMana = mines2[1], groveMana = 0 },
			[Race.Dwarf] = { gold = 1, lifeMana = 0, runicMana = 0, deathMana = mines2[2], infernalMana = mines2[1], groveMana = 0 },
			[Race.Undead] = { gold = 1, lifeMana = mines2[2], runicMana = mines2[1], deathMana = 0, infernalMana = 0, groveMana = 0 },
			[Race.Heretic] = { gold = 1, lifeMana = mines2[2], runicMana = mines2[1], deathMana = 0, infernalMana = 0, groveMana = 0 },
			[Race.Elf] = { gold = 1, lifeMana = 0, runicMana = mines2[2], deathMana = mines2[1], infernalMana = 0, groveMana = 0 },
		},
		{	-- 2x2 T2: 3 = 1 золото, 1 "важная" мана, 1 "неважная" мана
			[Race.Human] = { gold = 1, lifeMana = 0, runicMana = mines1[2], deathMana = mines2[2], infernalMana = mines2[1], groveMana = mines1[1] },
			[Race.Dwarf] = { gold = 1, lifeMana = mines1[2], runicMana = 0, deathMana = mines2[2], infernalMana = mines2[1], groveMana = mines1[1] },
			[Race.Undead] = { gold = 1, lifeMana = mines2[2], runicMana = mines2[1], deathMana = 0, infernalMana = mines1[2], groveMana = mines1[1] },
			[Race.Heretic] = { gold = 1, lifeMana = mines2[2], runicMana = mines2[1], deathMana = mines1[2], infernalMana = 0, groveMana = mines1[1] },
			[Race.Elf] = { gold = 1, lifeMana = mines1[2], runicMana = mines2[2], deathMana = mines2[1], infernalMana = mines1[1], groveMana = 0 },
		}
	)
	return mines[race]

end

-- Источники т3
function getMinesZone3(race)
	local mines = {
		[Race.Human] = { gold = 1, lifeMana = 1},
		[Race.Dwarf] = { gold = 1, runicMana = 1},
		[Race.Undead] = { gold = 1, deathMana = 1},
		[Race.Heretic] = { gold = 1, infernalMana = 1},
		[Race.Elf] = { gold = 1, groveMana = 1},
	}
	return mines[race]
end

-- Источники т4
function getMinesZone4(races)
	local mines = {
		gold = 1,
		lifeMana = 1,
		runicMana = 1,
		deathMana = 1,
		infernalMana = 1,
		groveMana = 1,
	}
	for _, race in pairs(races) do
		if race == Race.Human then
			mines.lifeMana = 0
		elseif race == Race.Dwarf then
			mines.runicMana = 0
		elseif race == Race.Undead then
			mines.deathMana = 0
		elseif race == Race.Heretic then
			mines.infernalMana = 0
		elseif race == Race.Elf then
			mines.groveMana = 0
		end
	end
  return mines
end

----------------

-- Юниты для наёмников зоны 2
function unitsMercen0(race)
	local unitsm = {}
	local i = 1

	if race == Race.Human then
		unitsm[i] = { id = 'g003uu5001', level = 1, unique = false } i = i + 1 -- Боец ополчения
		unitsm[i] = { id = 'g000uu0001', level = 1, unique = false } i = i + 1 -- Сквайр
		unitsm[i] = { id = rnd(
				'g000uu0003', -- Имперский рыцарь
				'g000uu0005', -- Инквизитор
				'g000uu2015', -- Страж Святости
				'g003uu5003', -- Ревнитель
				'g000uu8311', -- Ардет
				'g000uu2030', -- Детектив
				'g000uu0154', -- Ассасин
				'g000uu2009' -- Клинок в тени
		), unique = true } i = i + 1
		unitsm[i] = { id = rnd(
				'g000uu7595', -- Рефаим
				'g000uu7562', -- Бореалис
				'g000uu0013', -- Священник
				'g000uu7569', -- Иерей
				'g000uu0017', -- Аббатиса
				'g001uu0021', -- Маг
				'g000uu0153', -- Ученик-элементалист
				'g001uu7581' -- Заклинатель
		), unique = true } i = i + 1

		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g003uu5002', level = 2, unique = true } i = i + 1 end -- Алебардист
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } i = i + 1 end -- Волшебник
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu7561', level = 2, unique = true } i = i + 1 end -- Егерь
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0012', level = 2, unique = true } i = i + 1 end -- Жрец
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0016', level = 2, unique = true } i = i + 1 end -- Монахиня
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2014', level = 2, unique = true } i = i + 1 end -- Оруженосец
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0004', level = 2, unique = true } i = i + 1 end -- Охотник на ведьм
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2029', level = 2, unique = true } i = i + 1 end -- Поборник
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0007', level = 2, unique = true } i = i + 1 end -- Рейнджер
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0002', level = 2, unique = true } i = i + 1 end -- Рыцарь
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8310', level = 2, unique = true } i = i + 1 end -- Саггитар

	elseif race == Race.Dwarf then
		unitsm[i] = { id = 'g000uu0036', level = 1, unique = false } i = i + 1 -- Гном
		unitsm[i] = { id = 'g004uu5039', level = 1, unique = false } i = i + 1 -- Снежный волк
		unitsm[i] = {
			id = rnd(
				'g000uu0162', -- Защитник горна
				'g000uu7568', -- Сотрясатель
				'g001uu7571', -- Белый волк
				'g004uu8005' -- Гарм
			),
			unique = true
		} i = i + 1

		unitsm[i] = {
			id = rnd(
				rnd(
					'g000uu0038', -- Ветеран
					'g000uu0041', -- Горец
					'g006uu1128', -- Мастер печи
					'g000uu0035', -- Друид
					'g000uu0161', -- Алхимик
					'g000uu7558' -- Исса
				),
				'g000uu0030', -- Горный великан
				'g000uu7583' -- Йамму
			),
			unique = true
		} i = i + 1

		if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } i = i + 1 end -- Арбалетчик
		if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } i = i + 1 end -- Воин
		if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } i = i + 1 end -- Посвященная

	elseif race == Race.Undead then
		unitsm[i] = { id = 'g000uu0086', level = 1, unique = false } i = i + 1 -- Воин
		unitsm[i] = { id = 'g001uu7539', level = 1, unique = false } i = i + 1 -- Колотун
		unitsm[i] = {
			id = rnd(
				'g000uu0082', -- Некромант
				'g000uu0085', -- Злой дух
				'g003uu5012', -- Орк-палач
				'g000uu0088', -- Скелет-воин
				'g000uu0091', -- Лорд Тьмы
				'g000uu2007' -- Мумификатор
			),
			unique = true
		} i = i + 1

		unitsm[i] = {
			id = rnd(
				'g000uu0094', -- Дракон Рока
				rnd(
					'g001uu7563', -- Волколак
					'g001uu7564', -- Хорт
					'g001uu7565' -- Чумной оборотень
				),
				rnd(
					'g000uu0174', -- Тень
					'g001uu8267' -- Эльф-призрак
				)
			),
			unique = true
		} i = i + 1

		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu7542', level = 2, unique = true } i = i + 1 end -- Чумотворец
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0087', level = 2, unique = true } i = i + 1 end -- Зомби
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0081', level = 2, unique = true } i = i + 1 end -- Колдун
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } i = i + 1 end -- Призрак
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0090', level = 2, unique = true } i = i + 1 end -- Тамплиер
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g003uu5013', level = 2, unique = true } i = i + 1 end -- Череполом

	elseif race == Race.Heretic then
		unitsm[i] = { id = 'g000uu0052', level = 1, unique = false } i = i + 1 -- Одержимый
		unitsm[i] = { id = 'g000uu0062', level = 1, unique = false } i = i + 1 -- Сектант
		unitsm[i] = { id = rnd('g000uu0054', 'g000uu2003', 'g000uu0064', 'g000uu0068'), level = 3, unique = true } i = i + 1 -- Черный паладин / Мучитель / Демонолог / Колдунья
		unitsm[i] = { id = rnd('g000uu0058', 'g000uu7577'), level = 2, unique = true } i = i + 1 -- Демон / Сатир
		unitsm[i] = { id = rnd('g000uu7572', 'g000uu0056'), level = 2, unique = true } i = i + 1 -- Апатитовая горгулья / Мраморная гаргулья

		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } i = i + 1 end -- Берсеркер
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } i = i + 1 end -- Ведьма
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } i = i + 1 end -- Темный колдун

	elseif race == Race.Elf then
		unitsm[i] = { id = 'g000uu8014', level = 1, unique = false } i = i + 1 -- Кентавр-копейщик
		unitsm[i] = { id = 'g000uu8036', level = 1, unique = false } i = i + 1 -- Энт Малый

		unitsm[i] = {
			id = rnd(
				'g001uu7579', -- Кентавр-гвардеец
				'g000uu8027', -- Архонт
				'g000uu8028', -- Тиург
				'g000uu8020', -- Стингер
				'g000uu8023', -- Стражник
				'g000uu8024' -- Часовой
			),
			unique = true
		} i = i + 1

		unitsm[i] = {
			id = rnd(
				'g000uu8030', -- Владыка Небес
				'g003uu8038', -- Энт-целитель
				rnd(
					'g000uu8033', -- Лесная дева
					'g000uu8017', -- Кентавр-дикарь
					'g000uu2012', -- Кентавр Стрелок
					'g000uu8227', -- Дентрофонт
					'g000uu8021' -- Бандит
				)
			),
			unique = true
		} i = i + 1

		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8015', level = 2, unique = true } i = i + 1 end -- Кентавр-латник
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8016', level = 2, unique = true } i = i + 1 end -- Кентавр-странник
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } i = i + 1 end -- Оракул
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8019', level = 2, unique = true } i = i + 1 end -- Охотник
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8022', level = 2, unique = true } i = i + 1 end -- Сторож
		if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } i = i + 1 end -- Чанелер

	end

	return unitsm
end


-- Наёмники в зоне 2
function zoneMercenZone2(race)
	return {
		{
			units = unitsMercen0(race),
		}
	}
end


-- Юниты для наёмников 1 зоны 3
function unitsMercen1()
	local unitsm = {}
	local i = 1

	unitsm[i] = rnd(
		{ id = 'g000uu7629', level = 1, unique = false }, -- Благородный эльф 175
		{ id = 'g000uu7628', level = 1, unique = false }, -- Имперский гвардеец 175
		{ id = 'g000uu7627', level = 1, unique = false }, -- Советник Витара 175
		{ id = 'g001uu7592', level = 1, unique = false }, -- Торхот 175
		{ id = 'g000uu7605', level = 1, unique = false } -- Скульптор лжи 175
	) i = i + 1

	if mercenary_mode < 4 then
		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu2015', level = 3, unique = true } i = i + 1 end -- Страж Святости 695
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu7562', level = 3, unique = true } i = i + 1 end -- Бореалис 805
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu7595', level = 2, unique = true } i = i + 1 end -- Рефаим 915

		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g001uu7571', level = 2, unique = true } i = i + 1 end -- Белый волк 710
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g006uu1128', level = 3, unique = true } i = i + 1 end -- Мастер печи 875
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8224', level = 3, unique = true } i = i + 1 end -- Каменный великан 1880

		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g001uu7579', level = 3, unique = true } i = i + 1 end -- Кентавр-гвардеец 905
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8028', level = 3, unique = true } i = i + 1 end -- Тиург 730
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8020', level = 3, unique = true } i = i + 1 end -- Стингер 830

		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu0054', level = 3, unique = true } i = i + 1 end -- Черный паладин 630
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7574', level = 3, unique = true } i = i + 1 end -- Цитриновая гаргулья 1880
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu0171', level = 3, unique = true } i = i + 1 end -- Подражатель 1200

		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu0088', level = 3, unique = true } i = i + 1 end -- Скелет-воин 720
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7565', level = 2, unique = true } i = i + 1 end -- Чумной оборотень 600
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu0085', level = 3, unique = true } i = i + 1 end -- Злой дух 810
	end

	if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu8151', level = 1, unique = true } i = i + 1 end -- Фурия 1215
	if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu8218', level = 1, unique = true } i = i + 1 end -- Волхв 1750
	if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu7567', level = 1, unique = true } i = i + 1 end -- Первородная сущность (ожог) 1800

	if mercenary_mode >= 3 then
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7624', level = 1, unique = true } i = i + 1 end -- Неприкаянная 1900
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu6117', level = 1, unique = true } i = i + 1 end -- Костяной лорд 3250
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu8255', level = 1, unique = true } i = i + 1 end -- Эльф-тень 3200
		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g001uu7601', level = 1, unique = true } i = i + 1 end -- Адепт культа 3600
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7625', level = 1, unique = true } i = i + 1 end -- Темный оракул 3700
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8231', level = 1, unique = true } i = i + 1 end -- Катафрактарий 4700
	end

	if mercenary_mode >= 4 then
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu7589', level = 1, unique = true } i = i + 1 end -- Осквернитель 2500
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7618', level = 1, unique = true } i = i + 1 end -- Ересиарх 3800
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7541', level = 1, unique = true } i = i + 1 end -- Свежеватель 6500
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu6111', level = 1, unique = true } i = i + 1 end -- Командор легиона 7000
	end

	if mercenary_mode >= 5 then
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g006uu1016', level = 1, unique = true } i = i + 1 end -- Костяной голем 4500
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8006', level = 1, unique = true } i = i + 1 end -- Провидец эльфов 9000
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7585', level = 1, unique = true } i = i + 1 end -- Мастер культа 9500
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu8298', level = 1, unique = true } i = i + 1 end -- Избранник богов 9900
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8003', level = 1, unique = true } i = i + 1 end -- Дева битвы 9950
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8001', level = 1, unique = true } i = i + 1 end -- Небирос 9950
	end

	return unitsm
end

-- Юниты для наёмников 2 зоны 3
function unitsMercen2()
	local unitsm = {}
	local i = 1

	unitsm[i] = rnd(
		{ id = 'g000uu7629', level = 1, unique = false }, -- Благородный эльф 175
		{ id = 'g000uu7628', level = 1, unique = false }, -- Имперский гвардеец 175
		{ id = 'g000uu7627', level = 1, unique = false }, -- Советник Витара 175
		{ id = 'g001uu7592', level = 1, unique = false }, -- Торхот 175
		{ id = 'g000uu7605', level = 1, unique = false } -- Скульптор лжи 175
	) i = i + 1

	if mercenary_mode < 4 then
		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g003uu5003', level = 3, unique = true } i = i + 1 end -- Ревнитель 765
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu0154', level = 3, unique = true } i = i + 1 end -- Ассасин 805
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu0010', level = 3, unique = true } i = i + 1 end -- Маг 705

		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu0041', level = 3, unique = true } i = i + 1 end -- Горец 795
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu7568', level = 3, unique = true } i = i + 1 end -- Сотрясатель 875
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu7583', level = 2, unique = true } i = i + 1 end -- Йамму 1015

		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu2012', level = 3, unique = true } i = i + 1 end -- Кентавр Стрелок 855
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8227', level = 3, unique = true } i = i + 1 end -- Дентрофонт 730
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8030', level = 2, unique = true } i = i + 1 end -- Владыка Небес 925

		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu2003', level = 3, unique = true } i = i + 1 end -- Мучитель 630
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu8272', level = 3, unique = true } i = i + 1 end -- Азуритовая гаргулья 1880
		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g070uu9000', level = 3, unique = true } i = i + 1 end -- Теневидец 710

		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu0091', level = 3, unique = true } i = i + 1 end -- Лорд Тьмы 770
		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g001uu7563', level = 2, unique = true } i = i + 1 end -- Волколак 600
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu2007', level = 3, unique = true } i = i + 1 end -- Мумификатор 860
	end

	if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g001uu7560', level = 1, unique = true } i = i + 1 end -- Каратель 1230
	if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g002uu5026', level = 1, unique = true } i = i + 1 end -- Элементаль воды 1450
	if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu7566', level = 1, unique = true } i = i + 1 end -- Первородная сущность (мороз) 1800

	if mercenary_mode >= 3 then
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7624', level = 1, unique = true } i = i + 1 end -- Неприкаянная 1900
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu6117', level = 1, unique = true } i = i + 1 end -- Костяной лорд 3250
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu8255', level = 1, unique = true } i = i + 1 end -- Эльф-тень 3200
		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g001uu7601', level = 1, unique = true } i = i + 1 end -- Адепт культа 3600
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7625', level = 1, unique = true } i = i + 1 end -- Темный оракул 3700
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8231', level = 1, unique = true } i = i + 1 end -- Катафрактарий 4700
	end

	if mercenary_mode >= 4 then
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8219', level = 1, unique = true } i = i + 1 end -- Верховный некромант 2575
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu7603', level = 1, unique = true } i = i + 1 end -- Несущий скорбь 3800
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu6116', level = 1, unique = true } i = i + 1 end -- Мантикора 5600
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8008', level = 1, unique = true } i = i + 1 end -- Падший инквизитор 8000
	end

	if mercenary_mode >= 5 then
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8256', level = 1, unique = true } i = i + 1 end -- Костяной дракон 6275
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7584', level = 1, unique = true } i = i + 1 end -- Небесный страж 9500
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu6102', level = 1, unique = true } i = i + 1 end -- Падший 9900
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8002', level = 1, unique = true } i = i + 1 end -- Множество 9950
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu8307', level = 1, unique = true } i = i + 1 end -- Мертворожденная 9950
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8001', level = 1, unique = true } i = i + 1 end -- Небирос 9950
	end

	return unitsm
end


-- Юниты для наёмников 3 зоны 3
function unitsMercen3()
	local unitsm = {}
	local i = 1

	unitsm[i] = rnd(
		{ id = 'g000uu7629', level = 1, unique = false }, -- Благородный эльф 175
		{ id = 'g000uu7628', level = 1, unique = false }, -- Имперский гвардеец 175
		{ id = 'g000uu7627', level = 1, unique = false }, -- Советник Витара 175
		{ id = 'g001uu7592', level = 1, unique = false }, -- Торхот 175
		{ id = 'g000uu7605', level = 1, unique = false } -- Скульптор лжи 175
	) i = i + 1

	if mercenary_mode < 4 then
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu0005', level = 3, unique = true } i = i + 1 end -- Инквизитор 775
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu2009', level = 3, unique = true } i = i + 1 end -- Клинок в тени 805
		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g001uu7581', level = 3, unique = true } i = i + 1 end -- Заклинатель 705

		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu0038', level = 3, unique = true } i = i + 1 end -- Ветеран 795
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu0162', level = 3, unique = true } i = i + 1 end -- Защитник горна 875
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g004uu8005', level = 2, unique = true } i = i + 1 end -- Гарм 710

		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8017', level = 3, unique = true } i = i + 1 end -- Кентавр-дикарь 855
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8027', level = 3, unique = true } i = i + 1 end -- Архонт 730
		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu8021', level = 3, unique = true } i = i + 1 end -- Бандит 830

		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu0064', level = 3, unique = true } i = i + 1 end -- Демонолог 760
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7573', level = 3, unique = true } i = i + 1 end -- Чароитовая гаргулья 1880
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g004uu6101', level = 2, unique = true } i = i + 1 end -- Дьяволенок 916

		if math.random(0,1) == 1 then unitsm[i] = { id = 'g003uu5012', level = 3, unique = true } i = i + 1 end -- Орк-палач 880
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7564', level = 2, unique = true } i = i + 1 end -- Хорт 600
		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu0082', level = 3, unique = true } i = i + 1 end -- Некромант 710
	end

	if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu6121', level = 1, unique = true } i = i + 1 end -- Дхампир 1070
	if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu8277', level = 1, unique = true } i = i + 1 end -- Уста богов 1520
	if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g000uu8237', level = 1, unique = true } i = i + 1 end -- Первородная сущность (рб) 1800

	if mercenary_mode >= 3 then
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7624', level = 1, unique = true } i = i + 1 end -- Неприкаянная 1900
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu6117', level = 1, unique = true } i = i + 1 end -- Костяной лорд 3250
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu8255', level = 1, unique = true } i = i + 1 end -- Эльф-тень 3200
		if math.random(0,1) ~= 1 then unitsm[i] = { id = 'g001uu7601', level = 1, unique = true } i = i + 1 end -- Адепт культа 3600
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7625', level = 1, unique = true } i = i + 1 end -- Темный оракул 3700
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8231', level = 1, unique = true } i = i + 1 end -- Катафрактарий 4700
	end

	if mercenary_mode >= 4 then
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g005uu6111', level = 1, unique = true } i = i + 1 end -- Пожиратель 2600
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7587', level = 1, unique = true } i = i + 1 end -- Ведьмак 2730
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g005uu6002', level = 1, unique = true } i = i + 1 end -- Ангел Перерожденный 6000
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu6110', level = 1, unique = true } i = i + 1 end -- Гидра 7000

	end

	if mercenary_mode >= 5 then
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu8259', level = 1, unique = true } i = i + 1 end -- Колосс 6300
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu6118', level = 1, unique = true } i = i + 1 end -- Королева эльфов 5500
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g001uu7606', level = 1, unique = true } i = i + 1 end -- Темный повелитель 9500
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8004', level = 1, unique = true } i = i + 1 end -- Исчадие 9950
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8050', level = 1, unique = true } i = i + 1 end -- Стражник Императора 9950
		if math.random(0,1) == 1 then unitsm[i] = { id = 'g000uu8001', level = 1, unique = true } i = i + 1 end -- Небирос 9950
	end

	return unitsm
end

-- Наёмники в зоне 3
function zoneMercenZone3(merc_id)
	local merc_units = {
		unitsMercen1(),
		unitsMercen2(),
		unitsMercen3()
	}
	shake(merc_units)
	if merc_id == 1 then
		return {
			{
				name = merc_c_data[merc_id].name,
				description = merc_c_data[merc_id].description,
				units = merc_units[1]
			}
		}
	elseif merc_id == 2 then
		return {
			{
				name = merc_c_data[merc_id].name,
				description = merc_c_data[merc_id].description,
				units = merc_units[2]
			}
		}
	end
end

----------------------

-- Сундуки Респ
function bags0()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 250, max = 250 },
		itemValue = { min = 250, max = 250 },
			items = {
				rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				rnd({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), --2хил25/хил50
				{ id = d15(), min = 1, max = 1 },
			}
	}
}
end

-- Сундуки т1
function bags1()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 500, max = 500 },
		itemValue = { min = 250, max = 500 },
			items = {
				rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				rnd({ id = 'g001ig0180', min = 3, max = 3 }, { id = 'g001ig0378', min = 1, max = 1 }), --3хил25/хил75
				{ id = e2(), min = 1, max = 1 },
			}
	}
}
end

-- Сундуки т2
function bags2()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 750, max = 750 },
		itemValue = { min = 250, max = 750 },
			items = {
				rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				rnd({ id = 'g000ig0005', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --2хил50/хил100
				{ id = e4(), min = 1, max = 1 },
			}
		}
}
end

-- Сундуки т3
function bags3()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 1500, max = 1500 },
		itemValue = { min = 500, max = 500 },
			items = {
				{ id = 'g000ig0001', min = 2, max = 2 }, --рес
				{ id = 'g000ig0006', min = 2, max = 2 }, --хил100
				{ id = 'g000ig0018', min = 1, max = 1 }, --хил200
				{ id = pw5(), min = 1, max = 1 },
				{ id = pw5(), min = 1, max = 1 },
				{ id = pw5(), min = 1, max = 1 },
			}
		}
	}
end

----------------------
-- МОИ ФУНКЦИИ
----------------------

-- Быль или не быть 50%
function yn(what)
	local radn = math.random(0,1)
	if radn == 0 then
		return what
	elseif radn == 1 then
		return ""
	end
end

-- Быль или не быть 66%
function yn3(what)
	local radn = math.random(0,2)
	if radn == 0 then
		return what
	elseif radn == 1 then
		return what
	elseif radn == 2 then
		return ""
	end
end

-- случайный
function rnd(...)
    return (select(math.random(select('#', ...)), ...))
end

-- Режим карты
function gmm(what1, what2, what3)
	if gmode == 1 then
		return what1
	elseif gmode == 2 then
		return what2
	elseif gmode == 3 then
		return what3
	end
end

-- Специальный режим карты
function smm(whatever, what456)
	if smode == (4 or 5 or 6) then
		return what456
	else
		return whatever
	end
end

-- Режим рынка
function mmc(what1, what2)
	if market_mode == 1 or gmode == 1 then
		return what1
	elseif market_mode == 2 and (gmode == 2 or gmode == 3) then
		return what2
	end
end

-- изменить порядок значений в таблице
function swap(array, index1, index2)
	array[index1], array[index2] = array[index2], array[index1]
end

-- перемешать таблицу
function shake(array)
	local counter = #array

	while counter > 1 do
		local index = math.random(counter)

		swap(array, index, counter)
		counter = counter - 1
	end
end

-- проверить наличие значения в таблице
function isTableContains(table, item)
    found = false
    for _, v in pairs(table) do
        if v == item then
            found = true
        end
    end
    return found
end

-- выбрать id и вернуть его, другие добавить в таблицу, если значения не в списке игнора
function rndAndSave(saveArray, values, ignore)
	shake(values)
	local res
	for _, v in pairs(values) do
		if res then
			if not isTableContains(ignore, v) then
				table.insert(saveArray, v)
			end
		elseif not res then
			res = v
		end
	end
	return res
end

-- преобразует таблицу из { key = N } в массив { keyN1, keyN2 ... keyNx }
function convertN(tbl)
	local result = {}
	for k, n in pairs(tbl) do
		for _=1,n,1 do
			table.insert(result, k)
		end
	end
	return result
end


-- субраса игрока
function getPlayerSubRace(race)
	local items = {
		[Race.Human] = Subrace.Human,
		[Race.Dwarf] = Subrace.Dwarf,
		[Race.Undead] = Subrace.Undead,
		[Race.Heretic] = Subrace.Heretic,
		[Race.Elf] = Subrace.Elf,
	}
	return items[race]
end

-- фракционные лидеры
function getFactionLeaders(race)
	local items = {
		[Race.Human] = {'g000uu0019', 'g000uu0020', 'g000uu8248'},
		[Race.Dwarf] = {'g000uu0044', 'g000uu0045', 'g000uu8249'},
		[Race.Undead] = {'g000uu0096', 'g000uu8252', 'g000uu8253'},
		[Race.Heretic] = {'g000uu0070', 'g000uu0071', 'g000uu8250'},
		[Race.Elf] = {'g000uu8009', 'g000uu8011', 'g000uu8010'},
	}
	return items[race]
end

function getGuardRace(races)
	local guardRaces = {
		Race.Human,
		Race.Dwarf,
		Race.Undead,
		Race.Heretic,
		Race.Elf,
	}
	shake(guardRaces)
	for _, v in pairs(guardRaces) do
		if not isTableContains(races, v) then
			return v
		end
	end
end

-- родной шар манны
function ExtraHomeMana(race)
	local items = {
		[Race.Human] = 'g001ig0146', -- Шар маны Жизни
		[Race.Dwarf] = 'g001ig0148', -- Шар маны Рун
		[Race.Undead] = 'g001ig0149', -- Шар маны Смерти
		[Race.Heretic] = 'g001ig0147', -- Шар маны Преисподней
		[Race.Elf] = 'g001ig0150', -- Шар Лесного эликсира
	}
	return items[race]
end

-- родной малый шар манны
function ExtraSmallHomeMana(race)
	local items = {
		[Race.Human] = 'g001ig0481', -- Шар маны Жизни
		[Race.Dwarf] = 'g001ig0483', -- Шар маны Рун
		[Race.Undead] = 'g001ig0484', -- Шар маны Смерти
		[Race.Heretic] = 'g001ig0482', -- Шар маны Преисподней
		[Race.Elf] = 'g001ig0485', -- Шар Лесного эликсира
	}
	return items[race]
end

-- доп малый шар в ст-ице на старте на спец. заклы
function ExtraSmallManaProject4(race)
	local items = {
		[Race.Human] = rnd('g001ig0484','g001ig0482'), -- Шар маны Смерти \ Шар маны Преисподней
		[Race.Dwarf] = rnd('g001ig0484','g001ig0482'), -- Шар маны Смерти \ Шар маны Преисподней
		[Race.Undead] = rnd('g001ig0481','g001ig0483'), -- Шар маны Жизни \ Шар маны Рун
		[Race.Heretic] = rnd('g001ig0481','g001ig0483'), -- Шар маны Жизни \ Шар маны Рун
		[Race.Elf] = rnd('g001ig0484','g001ig0483'), -- Шар маны Смерти \ Шар маны Рун
	}
	return items[race]
end


-- доп шар в ст-ице на старте на спец. заклы
function ExtraManaProject4(race)
	local items = {
		[Race.Human] = rnd('g001ig0149','g001ig0147'), -- Шар маны Смерти \ Шар маны Преисподней
		[Race.Dwarf] = rnd('g001ig0149','g001ig0147'), -- Шар маны Смерти \ Шар маны Преисподней
		[Race.Undead] = rnd('g001ig0146','g001ig0148'), -- Шар маны Жизни \ Шар маны Рун
		[Race.Heretic] = rnd('g001ig0146','g001ig0148'), -- Шар маны Жизни \ Шар маны Рун
		[Race.Elf] = rnd('g001ig0149','g001ig0148'), -- Шар маны Смерти \ Шар маны Рун
	}
	return items[race]
end


-- случайный малый шар манны
function rmss()
	return rnd(
			'g001ig0481', --жизни
			'g001ig0482', --преисп.
			'g001ig0483', --рун
			'g001ig0484', --смерти
			'g001ig0485' --лес
	)
end


-- случайный шар манны
function rms()
	return rnd(
			'g001ig0146', --жизни
			'g001ig0147', --преисп.
			'g001ig0148', --рун
			'g001ig0149', --смерти
			'g001ig0150' --лес
	)
end

-- случайный большой шар манны
function rmsb()
	return rnd(
			'g001ig0277', --жизни
			'g001ig0278', --преисп.
			'g001ig0279', --рун
			'g001ig0280', --смерти
			'g001ig0281' --лес
	)
end

-- случайная банка на 30
function b30()
	return rnd(
			'g000ig0003', --зашита
			'g002ig0008', --Эликсир скрытого потенциала (точность2 +20)
			'g000ig0009', --точность
			'g000ig0012', --ини
			'g000ig0015' --атака
	)
end

-- случайная банка на 15
function b15()
	return rnd(
			'g000ig0002', --зашита
			'g000ig0008', --точность
			'g000ig0011', --ини
			'g000ig0014' --атака
	)
end

-- случайная банка вард от стихий
function w15()
	return rnd(
			'g000ig0021', --воздух
			'g000ig0022', --вода
			'g000ig0023', --земля
			'g000ig0024' --огонь
	)
end
-- случайная банка вард от дотов и спец урона
function d15()
	return rnd(
			'g001ig0329', -- Эликсир защиты от дота
			'g001ig0341', -- Эликсир защиты от аффекта
			'g001ig0343', --Эликсир защиты от проклятий
			'g001ig0351' --Эликсир защиты от поглощения
	)
end

-- случайный эликсир 200-375 + эффект варды (от-яд з1)
function e2()
	return rnd(
			'g001ig0560', -- Зелье провокатора 25принять
			'g001ig0547', -- Зелье пронзающего взгляда +10крит
			'g001ig0490', -- Зелье выносливости +25оз
			'g001ig0329', -- Эликсир защиты от дота
			'g001ig0351', -- Эликсир защиты от поглощения
			'g001ig0343' -- Эликсир защиты от проклятий
	)
end

-- случайный эликсир 400-500 + афф.вард
function e4()
	return rnd(
			'g001ig0562', -- Зелье дуэлянта +20крит
			'g001ig0491', -- Зелье похищения жизни +25вамп
			'g001ig0355', -- Зелье тритоньей чешуи +вардурон
			'g001ig0127', -- Эликсир жизненной силы +50максоз
			'g001ig0128', -- Эликсир защиты от Оружия
			'g001ig0341', -- Эликсир защиты от аффекта
			'g002ig0006', -- Зелье бдительности 500 (30 ворам)
			'g002ig0008' -- Эликсир скрытого потенциала 500 (20оз +7точ.вт.атаки)
	)
end

-- случайный пермо вард 500
function pw5()
	return rnd(
			'g001ig0332', -- Зелье ихора Танатоса вард-яд
			'g001ig0334', -- Эликсир безраздельности имун-имитация
			'g001ig0328', -- Эликсир ледяной плоти вард-мороз
			'g001ig0330', -- Эликсир Неопалимых вард-ожог
			'g001ig0346', -- Эликсир неудержимости вард-ослабление
			'g001ig0344', -- Эликсир предназначения вард-замедление
			'g001ig0346' -- Эликсир неудержимости вард-ослабление
	)
end

-- случайный пермо вард 600
function pw6()
	return rnd(
			'g001ig0354', -- Жидкий металл Уру вард-разрушение
			'g001ig0320', -- Зелье глубинного чудища вард-вода
			'g001ig0325', -- Зелье здравомыслия вард-разум
			'g001ig0326', -- Зелье немертвых вард-смерть
			'g001ig0323', -- Зелье родства с пламенем вард-огонь
			'g001ig0322', -- Зелье текучего камня вард-земля
			'g001ig0321', -- Зелье укротителя небосвода вард-воздух
			'g001ig0352', -- Эликсир гонителя нечисти вард-тауматургии
			'g001ig0534' -- Экстракт таинственной энергии (смена атаки)
	)
end

-- случайный пермо-эликсир на 5% за 400
function p05()
	return rnd(
			'g001ig0307', -- Зелье стойкости +5брони
			'g001ig0309', -- Эликсир задиры +5ини
			'g001ig0311', -- Эликсир хладнокровия +5точности
			'g001ig0313', -- Эликсир совершенствования +5урон
			'g001ig0315' -- Зелье великана +5ОЗ
	)
end

-- случайный пермо-эликсир на 15% за 1200
function p15()
	return rnd(
			'g001ig0308', -- Зелье заступника +15брони
			'g001ig0310', -- Эликсир опережения +15ини
			'g001ig0314', -- Эликсир наследия +15урон
			'g001ig0513', -- Зелье твердого шага +5мувов
			'g001ig0522' -- Зелье посла +неподкупность
	)
end

-- р-ны 0 пул наград 1 400
function ruin01()
	return rnd(
			'g001ig0493', -- Книга божественных даров +арты
			'g001ig0494', -- Книга странника +сапоги
			'g001ig0495', -- Книга наследия +знамёна
			'g001ig0428', -- Кожаные эльфийские доспехи (Реликвия)
			'g001ig0426', -- Куртка капитана (Реликвия)
			'g001ig0111', -- Сапоги ассасина
			'g001ig0114', -- Тяжелые сапоги
			'g001ig0609', -- Загробный фонарь (Артефакт)
			'g002ig0001' -- Потайной кинжал (Артефакт)
	)
end

-- р-ны 0 пул наград 2 з400 а500
function ruin02()
	return rnd(
			'g000ig3017', -- Кинжал Вампиризма (Артефакт)
			'g001ig0182', -- Счастливая кость (Артефакт)
			'g000ig2002', -- Святая чаша (Артефакт)
			'g001ig0048', -- Амулет Кракена (Артефакт)
			'g000ig1005', -- Знамя быстроты
			'g001ig0051', -- Знамя выносливости
			'g000ig1001', -- Знамя защиты
			'g000ig1007', -- Знамя силы
			'g000ig1003' -- Знамя сражения
	)
end

-- р-ны 1 пул наград 600
function ruin1()
	return rnd(
			'g001ig0582', -- Камень врат (Артефакт)
			'g000ig3002', -- Дьявольская чаша (Артефакт)
			'g001ig0487', -- Кольцо темных искуств (Артефакт)
			'g001ig0605', -- Книга постижения
			'g000ig3022', -- Лютня Очарования (Реликвия)
			'g001ig0427', -- Нагрудник Стража (Реликвия)
			'g001ig0370', -- Знамя искоренителя ереси
			'g001ig0369' -- Знамя снежной охоты
	)
end

-- заклы со старта
function CapSpell(race)
	local items = {
		[Race.Human] = rnd('g000ss0002', 'g000ss0003', 'g000ss0004', 'g000ss0009'), -- Быстрота\Сила\Молния\Истинное зрение
		[Race.Dwarf] = rnd('g000ss0021', 'g000ss0023', 'g000ss0024', 'g000ss0025'), -- Ледяной щит\Сила Витара\Буран\Призыв I: Рух
		[Race.Undead] = rnd('g000ss0061', 'g000ss0062', 'g000ss0065', 'g000ss0064'), -- Призыв I: Скелет\Мор\Ржавчина\Слабость
		[Race.Heretic] = rnd('g000ss0041', 'g000ss0042', 'g000ss0043', 'g000ss0044'), -- Incantare Hellhound\Incantare Hellhound Illudere\Ignis mare\Menta minoris
		[Race.Elf] = rnd('g000ss0097', 'g000ss0098', 'g000ss0101', 'g000ss0106'), -- Кустарник\Призыв I: Энт Малый\Стая\Смятение
	}
	return items[race]
end

-- талисман 1 (родной расы) - 200
function getTalisman1(race)
	items = {
		[Race.Human] = 'g000ig9101', -- Талисман Сквайра - 200
		[Race.Dwarf] = 'g001ig0265', -- Талисман кузнеца - 200
		[Race.Undead] = 'g001ig0264', -- Талисман мертвеца - 200
		[Race.Heretic] = 'g001ig0267', -- Талисман еретика - 200
		[Race.Elf] = 'g001ig0266', -- Талисман лесного воина - 200
	}
	return rnd(
			items[race],
			'g000ig9105', -- Талисман Костра - 200
			'g000ig9131' -- Талисман Ливня - 200
	)
end

-- талисман 2 - 500
function getTalisman2()
	return rnd(
			'g001ig0184', -- Талисман Восстановления - 400
			'g000ig9109', -- Талисман призыва нейтралов II - 450
			'g000ig9120' -- Талисман щита стихий - 500
	)
end

-- талисман 3 - 600-800
function getTalisman3()
	return rnd(
			'g001ig0259', -- Талисман призыва нейтралов III - 600
			'g000ig9128', -- Талисман Молнии - 800
			'g001ig0063', -- Талисман Прилива - 800
			'g000ig9116' -- Талисман Святой земли - 800
	)
end

-- талисман 4 - 1000
function getTalisman4()
	return rnd(
			'g001ig0202', -- Талисман призыва нейтралов IV - 1000
			'g000ig9130', -- Талисман Бури - 1000
			'g000ig9123' -- Талисман Пожара - 1000
	)
end

-- талисман 5 - 1200 - 1800
function getTalisman5()
	return rnd(
			'g001ig0202', -- Талисман призыва нейтралов V - 1200
			'g000ig9136', -- Талисман Горы - 1600
			'g001ig0185' -- Талисман Землетрясения - 1800
	)
end

-- случайная субраса
function rsub()
	return rnd(
			{Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf}, --люди
			{Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf}, --эльфы
			{Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf}, --демоны
			{Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf}, --гномы
			{Subrace.Undead, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --нежить
	)
end

-- субраса только не нежить
function NoUndead()
	return rnd(
			{ Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf }, --люди
			{ Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf }, --эльфы
			{ Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf }, --демоны
			{ Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf } --гномы
	)
end

-- выбрать заклинания для башни магии
function chooseSpells(spells, limit)
	local result = {}
	local n = 0
	shake(spells)
	for _,v in pairs(spells) do
		table.insert(result, v)
		n = n + 1
		if n >= limit then
			break
		end
	end
	return result
end

---------------------
--- Отряды на рынке
---------------------
function zmStack(playerRace)
	return {
		count = 1,
		value = { min = 1, max = 1 },
		owner = playerRace,
		name = workers_c_data[playerRace+1],
		leaderIds = { 'g000uu7599' } -- Ничто
	}
end

---------------------
--- Границы Т3
---------------------
local borders1 = {Border.Open, Border.Water, Border.SemiOpen}
local borders2 = {Border.Open, Border.Water, Border.SemiOpen}
function getBorderType(zoneId)
	if border_mode == 1 then -- открытые
		return Border.Open
	elseif border_mode == 2 then -- водные
		return Border.Water
	elseif border_mode == 3 then -- полуоткрытые
		return Border.SemiOpen
	elseif border_mode == 4 then -- случайные(разные)
		shake(borders1)
		return borders1[1]
	elseif border_mode == 5 then -- случайные(одинаковые)
		return borders1[1]
	elseif border_mode == 6 then -- случайные(зеркальные)
		if zoneId % 2 == 1 then
			return borders1[1]
		else
			return borders2[1]
		end
	end
end
---------------------
--- Отряды респ зона 0
---------------------

function z0Stacks1()
return {  -- 140*2
		subraceTypes = { Subrace.NeutralGreenSkin, Subrace.NeutralWolf },
		count = 2,
		value = { min = 280, max = 280*kr },
		loot = {
			items = {
				{ id = 'g001ig0180', min = 1, max = 1 }, --хил25
				{ id = getTalisman1(playerRace), min = 1, max = 1 },  -- Талисман 200
				{ id = rmss(), min = 1, max = 1 }, --случ. мал. шар манны
				rnd({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
			}
		}
}
end

function z0Stacks2()
return {  -- 150*2
		subraceTypes = rsub(),
		count = 2,
		value = { min = 300, max = 300*kr },
		loot = {
			items = {
				{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
				{ id = getTalisman1(playerRace), min = 1, max = 1 },  -- Талисман 200
				{ id = rnd('g000ig0011', 'g000ig0008'), min = 1, max = 1 }, --ини15/точность15
				{ id = rnd('g000ig0023', 'g000ig0022'), min = 1, max = 1 }, --земли/воды
			}
		}
}
end

function z0Stacks3()
return { -- 160*2
		subraceTypes = rsub(),
		count = 2,
		value = { min = 320, max = 320*kr },
		loot = {
			itemTypes = { Item.Orb },
			value = { min = 200, max = 200 },
			itemValue = { min = 100, max = 100 },
			items = {
				{ id = 'g001ig0378', min = 1, max = 1}, --хил75
				rnd({ id = 'g000ig0014', min = 1, max = 1 }, { id = 'g000ig0002', min = 1, max = 1 }), --атака15/защита15
			}
		}
}
end

function z0Stacks4(race)
return { -- 170*2
		subraceTypes = NoUndead(),
		count = 2,
		value = { min = 340, max = 340*kr },
		loot = {
			itemTypes = { Item.Scroll },
			value = { min = 400, max = 400 },
			itemValue = { min = 200, max = 200 },
			items = {
				rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				rnd({ id = ExtraSmallManaProject4(race), min = 1, max = 1 }, { id = rmss(), min = 1, max = 1 }), --случ. доп. мал. доп. / случ мал шар манны
			}
		}
}
end

function z0Stacks5()
return { -- 180*1
		subraceTypes = NoUndead(),
		count = 1,
		value = { min = 180, max = 180*kr },
		loot = {
			items = {
				{ id = 'g000ig0001', min = 1, max = 1 }, --рес
				{ id = 'g001ig0378', min = 1, max = 1 }, --хил75
				{ id = e2(), min = 1, max = 1 },
			}
		}
}
end

--------------
-- Отряды зона 1
--------------

function z1Stacks1(race)
return {  --200xp*2
		subraceTypes = { Subrace.NeutralGreenSkin, Subrace.NeutralWolf },
		count = 2,
		value = { min = 400*kef, max = 400*kef*kr },
		loot = {
			items = {
				{ id = 'g001ig0378', min = 2, max = 2 }, --хил75
				{ id = 'g001ig0431', min = 1, max = 1 }, --гранат75
				{ id = ExtraSmallManaProject4(race), min = 1, max = 1 }, --случ. мал. доп. шар манны
				rnd({ id = 'g000ig0011', min = 1, max = 1 }, { id = 'g000ig0008', min = 1, max = 1 }), --ини15/точность15
				{ id = w15(), min = 1, max = 1 }, --случ. вард
			}
		}
}
end

function z1Stacks2()
return { --220xp*2
		subraceTypes = rsub(),
		count = 2,
			value = { min = 440*kef, max = 440*kef*kr },
			loot = {
				itemTypes = { Item.Orb },
				value = { min = 400, max = 400 },
				itemValue = { min = 200, max = 200 },
				items = {
					rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
					rnd({ id = 'g000ig0014', min = 1, max = 1 }, { id = 'g000ig0002', min = 1, max = 1 }), --атака15/защита15
					rnd({ id = 'g000ig0021', min = 1, max = 1 }, { id = 'g000ig0024', min = 1, max = 1 }), --возд/огня
					{ id = getTalisman2(), min = 1, max = 1 },  -- Талисман 400-500

				}
			}

}
end

function z1Stacks3()
return { --240xp*2
		subraceTypes = rsub(),
		count = 2,
			value = { min = 480*kef, max = 480*kef*kr },
			loot = {
				itemTypes = { Item.Scroll },
				value = { min = 800, max = 800 },
				itemValue = { min = 400, max = 400 },
				items = {
					rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
					{ id = 'g001ig0378', min = 1, max = 1 }, --хил75
					rnd({ id = 'g000ig0022', min = 1, max = 1 }, { id = 'g000ig0023', min = 1, max = 1 }), --воды/земли
					{ id = rms(), min = 1, max = 1 }, --случ. шар манны
				}
			}
}
end

function z1Stacks4()
return { --280xp*1
		count = 1,
			subraceTypes = NoUndead(),
			value = { min = 280*kef, max = 280*kef*kr },
			loot = {
				items = {
					{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
					rnd({ id = 'g001ig0533', min = 1, max = 1 },{ id = 'g001ig0026', min = 1, max = 1 }), -- Зелье ясного взора / Аура регенерации +10реген аое
					{ id = b15(), min = 1, max = 1 }, --случ. банка15
					rnd({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти
				}
			}
}

end

function z1Stacks5()
return { --300xp*1
		count = 1,
			subraceTypes = NoUndead(),
			value = { min = 300*kef, max = 300*kef*kr },
			loot = {
				items = {
					{ id = 'g000ig0001', min = 1, max = 1 }, --рес
					{ id = 'g001ig0378', min = 1, max = 1 }, --хил75
					{ id = w15(), min = 1, max = 1 }, --случ. вард
					{ id = e4(), min = 1, max = 1 },
				}
			}
}
end

function z1Stacks6()
return { --320xp*1
		count = 1,
			subraceTypes = NoUndead(),
			value = { min = 320*kef, max = 320*kef*kr },
			loot = {
				itemTypes = { Item.Talisman, Item.Wand },
				value = { min = 200, max = 200 },
				itemValue = { min = 200, max = 200 },
				items = {
					{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
					{ id = getTalisman2(), min = 1, max = 1 },  -- Талисман 400-500
					{ id = d15(), min = 1, max = 1 }, --спец.вард
				}
			}
}
end

------------------
-- Отряды зона 2
------------------

function z2Stacks1()
return { -- 300xp*2
		subraceTypes = rsub(),
		count = 2,
		value = { min = 600*kef, max = 600*kef*kr},
		loot = {
			items = {
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = 'g001ig0378', min = 1, max = 1 }, --хил75
				{ id = 'g000ig7002', min = 1, max = 1 }, --кольцо100
				{ id = rms(), min = 1, max = 1 }, --случ. шар манны
				{ id = b15(), min = 1, max = 1 }, --случ. банка15
				rnd({ id = 'g001ig0128', min = 1, max = 1 }, { id = d15(), min = 1, max = 1 }), --оружия/дот.вард
			}
		},
	}
end

function z2Stacks2()
return { -- 400хп*2
		subraceTypes = rsub(),
		count = 2,
		value = { min = 800*kef, max = 800*kef*kr },
		loot = {
			itemTypes = { Item.Orb },
			value = { min = 800, max = 800 },
			itemValue = { min = 400, max = 400 },
			items = {
				rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				rnd({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти
				rnd({ id = e2(), min = 1, max = 1}, { id = 'g002ig0006', min = 1, max = 1}, { id = 'g002ig0008', min = 1, max = 1}), -- e2 / Зелье бдительности 500 / Эликсир скрытого потенциала 500
			}
		}
}
end

function z2Stacks3()
return { -- 500xp*2
		subraceTypes = rsub(),
		count = 2,
		value = { min = 1000*kef, max = 1000*kef*kr},
		loot = {
			itemTypes = { Item.Scroll },
			value = { min = 1100, max = 1100 },
			itemValue = { min = 550, max = 550 },
			items = {
				{ id = 'g000ig0001', min = 1, max = 1 }, --рес
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = 'g001ig0125', min = 1, max = 1 }, --разума
				{ id = rms(), min = 1, max = 1 }, --случ. шар манны
			}
		}
	}
end

function z2Stacks4()
return { -- 550хп*1
		subraceTypes = NoUndead(),
		count = 1,
		value = { min = 550*kef, max = 550*kef*kr },
		loot = {
			items = {
				rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				rnd({ id = 'g001ig0516', min = 1, max = 1 }, { id = 'g001ig0523', min = 1, max = 1 }), --Зелье омоложения разума(-10планка)/Зелье воеводы(+10опыта)
				{ id = w15(), min = 1, max = 1 }, --случ. вард
				{ id = 'g001ig0036', min = 1, max = 1 }, --смерти
			}
		},
}
end

function z2Stacks5()
return { -- 575хп*1
		subraceTypes = NoUndead(),
		count = 1,
		value = { min = 575*kef, max = 575*kef*kr },
		loot = {
			items = {
				{ id = 'g000ig0001', min = 1, max = 1 }, --рес
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = pw5(), min = 1, max = 1 }, --пермовард
				{ id = rnd(e2(), e2(), 'g002ig0005', 'g002ig0007'), min = 1, max = 1}, -- эл200 x2 / зелье наблюдательности / зелье магической устойчивости
			}
		},
}
end

function z2Stacks6()
return { -- 600хп*1
		subraceTypes = NoUndead(),
		count = 1,
		value = { min = 600*kef, max = 600*kef*kr },
		loot = {
			itemTypes = { Item.PotionPermanent },
			value = { min = 500, max = 600 },
			itemValue = { min = 500, max = 600 },
			items = {
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = rnd('g001ig0432', getTalisman3()), min = 1, max = 1 }, --аметист125 / Талисман 600-800
				{ id = b15(), min = 1, max = 1 }, --случ. банка15
			}
		},
	}
end

--------------------
-- Отряды зона 3
--------------------

function z3Stacks1(zshm)
return { -- 600xp
		subraceTypes = rsub(),
		count = 1,
		value = { min = 600*kef, max = 600*kef*kr},
		loot = {
			items = {
				rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес25%/хил100-75%
				rnd({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), --2хил25/хил50
				rnd({ id = zshm, min = 1, max = 1 }, { id = 'g001ig0432', min = 1, max = 1 }), --шар манны / аметист125
				rnd({ id = b15(), min = 1, max = 1 }, { id = w15(), min = 1, max = 1 }), --случ.банка15/случ.вард
			}
		},
	}
end

function z3Stacks2(zb30)
return { -- 700хп
		subraceTypes = rsub(),
		count = 1,
		value = { min = 700*kef, max = 700*kef*kr },
		loot = {
			items = {
				rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес25%/хил100-75%
				rnd({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), --2хил25/хил50
				rnd({ id = b30(), min = 1, max = 1 },{ id = 'g002ig0006', min = 1, max = 1 },{ id = 'g002ig0008', min = 1, max = 1 }), --случ. банка30 / Зелье бдительности -30воры / Эликсир скрытого потенциала 500
				rnd({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }, { id = d15(), min = 1, max = 1 }, { id = b15(), min = 1, max = 1 }, { id = w15(), min = 1, max = 1 }), -- разума/смерти | d15/b15|w15
			}
		}
	}
end

function z3Stacks3(zusil200)
return { -- 750хп
		subraceTypes = rsub(),
		count = 1,
		value = { min = 750*kef, max = 750*kef*kr },
		loot = {
			itemTypes = { Item.Orb },
			value = { min = 450, max = 600 },
			itemValue = { min = 450, max = 600 },
				items = {
					rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
					rnd({ id = 'g001ig0180', min = 3, max = 3 }, { id = 'g001ig0378', min = 1, max = 1 }), --3хил25/хил75
					{ id = zusil200, min = 1, max = 1 }, --усиление200
				}
		}
}
end

function z3Stacks4(zusil500, Scroll34)
return { -- 800хп
		subraceTypes = NoUndead(),
		count = 1,
		value = { min = 800*kef, max = 800*kef*kr },
		loot = {
			items = {
				rnd({ id = 'g001ig0378', min = 2, max = 2 }, { id = 'g001ig0378', min = 2, max = 2 }, { id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0018', min = 1, max = 1 }), -- хил75-50%/рес-25%/мазь-25%
				rnd({ id = 'g000ig0006', min = 1, max = 1 }, { id = 'g000ig0005', min = 2, max = 2 }), --хил100/2хил50
				{ id = zusil500, min = 1, max = 1 }, --усиление500
				{ id = Scroll34, min = 1, max = 1 }, --свиток т3/т4
			}
		}
}
end

function z3Stacks5(zperm)
return { -- 850хп
		subraceTypes = NoUndead(),
		count = 1,
		value = { min = 850*kef, max = 850*kef*kr },
		loot = {
			items = {
				rnd({ id = 'g000ig0006', min = 1, max = 1 }, { id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0018', min = 1, max = 1 }, { id = 'g000ig0018', min = 1, max = 1 }), -- хил100-25%/рес25%/мазь-50%
				rnd({ id = 'g001ig0378', min = 1, max = 1 }, { id = 'g000ig0005', min = 2, max = 2 }), --2хил75/3хил50
				{ id = zperm, min = 1, max = 1 }, --пермо400
				rnd({ id = rms(), min = 1, max = 1 }, { id = getTalisman4(), min = 1, max = 1 }, { id = b15(), min = 1, max = 1 }, { id = w15(), min = 1, max = 1 }), -- сл.шар/талисман 1000/b15/w15
			}
		}
}
end

function z3StacksX()
return { -- 1100хп
		subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
		count = 1,
		value = { min = 1100*kef, max = 1100*kef*kr },
		loot = {
			items = {
				{ id = 'g000ig0001', min = 1, max = 1 }, --рес
				rnd({ id = 'g001ig0378', min = 2, max = 2 }, { id = 'g000ig0006', min = 1, max = 1 }), --хил75/хил100
				rnd({ id = 'g001ig0152', min = 1, max = 1 }, { id = 'g000ig0018', min = 1, max = 1 }), -- Эликсир избавления/мазь
				{ id = p15(), min = 1, max = 1 }, --пермо 1200
				rnd({ id = 'g001ig0151', min = 1, max = 1 }, { id = 'g000ig7003', min = 1, max = 1 }), -- Шар колдовства/Изумруд (Драгоценность) 150
			}
		}
}
end

-------------------------

-- Охрана объектов

function guard1() -- зона1 --драги 250-375
return {
	value = { min = 230*kef, max = 230*kef*kr },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 250, max = 400 },
		itemValue = { min = 250, max = 400 },
		items = {
			{ id = 'g000ig0005', min = 1, max = 1}, -- хил50
		},
	}
}
end

function guard2() -- зона2 --драги 375-500
return {
	value = { min = 400*kef, max = 400*kef*kr },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 375, max = 525 },
		itemValue = { min = 375, max = 525 },
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, -- хил75
		},
	}
}
end

function guard2n() -- зона2 наём.
return {
	value = { min = 400*kef, max = 400*kef*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, -- хил100
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
		},
	}
}
end

function guard2m() -- зона2 башня
return {
	value = { min = 400*kef, max = 400*kef*kr },
	loot = {
		items = {
			rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = w15(), min = 1, max = 1 }, --случ. вард стих.
		},
	}
}
end

function guard3m() -- зона3 башня
return {
	value = { min = 750*kef, max = 750*kef*kr },
	loot = {
		items = {
			rnd({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			rnd({ id = 'g001ig0432', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --аметист125/случ. шар манны
			{ id = b15(), min = 1, max = 1}, -- случ. банка15
			{ id = w15(), min = 1, max = 1}, -- случ. вард
		},
	},
}
end

function guard3() -- зона3 --драги 500-625
return {
	value = { min = 750*kef, max = 750*kef*kr },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 500, max = 650 },
		itemValue = { min = 500, max = 650 },
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100
		},
	}
}
end

function guard3n() -- зона3 наём.
return {
	value = { min = 750*kef, max = 750*kef*kr },
	loot = {
		items = {
				{ id = 'g000ig0001', min = 1, max = 1 }, --рес
				{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
		},
	}
}
end

function specialGuard1(race) --
	if smm(false, true) then
		return {
			value = { min = 1, max = 1 },
			owner = race,
			leaderIds = { 'g000uu6004' }, -- Толстый бес
			leaderModifiers = convertN({
				g000um9023 = 1, -- Артефакты
				g000um9024 = 1, -- Реликвии
				g000um9025 = 1, -- Знамена
				g000um9027 = 1, -- Сферы
				g000um9029 = 1, -- Свитки
				g100um9003 = 10, -- +1 armor
				g201um9210 = 3, -- +10 move
				g201um9212 = 5, -- +1 move
				g201um9182 = 4, -- 25% bodyguard
				g201um9045 = 1, -- regen up to 25%
			}),
			loot = {
				items = {
					{ id = 'g001ig0128', min = 5, max = 5 }, -- Эликсир защиты от Оружия
				}
			}
		}
	end
end

function specialGuard2() --
	if smm(false, true) then
		return {
			count = 1,
			value = { min = 350, max = 350 },
			order = Order.Guard,
			name = 'Претендент',
			leaderIds = { 'g000uu6004' }, -- Толстый бес
			leaderModifiers = convertN({
				g000um9027 = 1, -- Сферы
				g201um9106 = 4, -- +1acc
				g201um9119 = 12, -- -1ini
				g201um9214 = 4, -- +50hp
			}),
			loot = {
				items = {
					{ id = 'g000ig9040', min = 1, max = 1 }, -- Сфера Полиморфа
				}
			}
		}
	end
end

-- Главная охрана т0-т4
function zoneGuardZone04(races)
return {
	subraceTypes = { getPlayerSubRace(guardRace) },
	leaderIds = getFactionLeaders(guardRace),
	value = { min = 700*kef, max = 700*kef*kr }, --
	loot = {
		value = { min = 300, max = 370 },
		itemValue = { min = 300, max = 370 },
		itemTypes = { Item.PotionPermanent },
		items = {
			{ id = 'g000ig0001', min = 2, max = 2 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			rnd({ id = 'g001ig0151', min = 1, max = 1 }, { id = 'g000ig7004', min = 1, max = 1 }), -- Шар колдовства/Золотое кольцо (Драгоценность)200
			{ id = p05(), min = 1, max = 1},
			rnd({id = b15(), min = 1, max = 1}, {id = w15(), min = 1, max = 1}, {id = d15(), min = 1, max = 1}),
		}
	}
}
end

-- Главная охрана т2 - т2
function zoneGuardZone2()
return {
	subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
	value = { min = 1500*kef, max = 1560*kef }, --
	loot = {
		value = { min = 600, max = 740 },
		itemValue = { min = 600, max = 740 },
		itemTypes = { Item.PotionPermanent },
		items = {
			{ id = 'g000ig0001', min = 2, max = 2 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			rnd({ id = 'g000ig7004', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --кольцо200/случ. шар манны
			rnd({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти
			{ id = rnd(e2(), e2(), 'g002ig0005', 'g002ig0007'), min = 1, max = 1}, -- эл200 x2 / зелье наблюдательности / зелье магической устойчивости
			{ id = p05(), min = 1, max = 1}, -- случ. пермо-эликсир на 5%
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
		}
	}
}
end


----------------------

-- СВОДНЫЕ ТАБЛИЦЫ

-- Вернет таблицу с описанием Респа 0
function getPlayerZone0(zoneId, playerRace, zoneSize)
	return {
		id = zoneId,
		type = Zone.PlayerStart,
		border = Border.Close,
		race = playerRace,
		size = zoneSize,
		ruins = z0Ruins(),
		mines = getMinesRespZ(playerRace),
		bags = bags0(),
		stacks = {z0Stacks1(), z0Stacks2(), z0Stacks3(), z0Stacks4(playerRace), z0Stacks5()},

		capital = {
			gapMask = 15,
			garrison = { -- столица
				subraceTypes = { getPlayerSubRace(playerRace) },
				value = { min = 50, max = 50 },
				loot = {
					itemTypes = { Item.Weapon, Item.Armor, Item.Jewel, Item.TravelItem },
					value = { min = 300, max = 300 },
					itemValue = { min = 300, max = 300 },
					items = {
						{ id = 'g001ig0530', min = 1, max = 1}, -- Зелье посмертного зова(талисманы)

						{ id = 'g000ig0001', min = 3, max = 3}, --рес
						{ id = 'g000ig0006', min = 4, max = 4}, --хил100
						{ id = 'g001ig0378', min = 5, max = 5}, --хил75
						{ id = 'g000ig0005', min = 6, max = 6}, -- хил50
						{ id = 'g001ig0180', min = 7, max = 7}, -- хил25

						{ id = 'g000ig0002', min = 1, max = 1 }, --15
						{ id = 'g000ig0014', min = 1, max = 1 }, --15
						{ id = 'g000ig0011', min = 1, max = 1 }, --15
						{ id = 'g000ig0008', min = 1, max = 1 }, --15
						{ id = b15(), min = 1, max = 1}, -- случ. банка15
						{ id = b15(), min = 1, max = 1}, -- случ. банка15

						{ id = 'g000ig0021', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0022', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0023', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0024', min = 1, max = 1 }, -- вард
						{ id = w15(), min = 1, max = 1}, -- случ. вард
						{ id = w15(), min = 1, max = 1}, -- случ. вард

						rnd({ id = 'g001ig0125', min = 1, max = 1 }, { id = 'g001ig0036', min = 1, max = 1 }), --разума/смерти
						rnd({ id = 'g001ig0355', min = 1, max = 1 }, { id = 'g001ig0128', min = 1, max = 1 }), --вардурон/вард оружия

						{ id = d15(), min = 1, max = 1}, -- случ. дотвард
						{ id = d15(), min = 1, max = 1}, -- случ. дотвард

						rnd({ id = 'g001ig0458', min = 1, max = 1}, { id = 'g000ig9031', min = 1, max = 1}, { id = 'g000ig9022', min = 1, max = 1}, { id = 'g001ig0302', min = 1, max = 1}), -- 25 Сфера Каменного проклятия / Сфера Ливня | Сфера Углей / Сфера Шторма
						rnd({ id = 'g001ig0189', min = 1, max = 1}, { id = 'g001ig0178', min = 1, max = 1}, { id = 'g001ig0472', min = 1, max = 1}, { id = 'g001ig0473', min = 1, max = 1}), -- 50 Сфера Камня / Сфера Костра | Сфера Ледяного осколка / Сфера Статического разряда

						{ id = ExtraManaProject4(playerRace), min = 1, max = 1 }, --доп.шар

						rnd({ id = 'g000ig5021', min = 1, max = 1}, { id = 'g000ig5003', min = 1, max = 1}, { id = 'g001ig0250', min = 1, max = 1}, { id = 'g000ig5023', min = 1, max = 1}), -- свиток л.щит, сила, с.кости, с.витара
						rnd({ id = 'g001ig0248', min = 1, max = 1}, { id = 'g000ig5045', min = 1, max = 1}, { id = 'g000ig5064', min = 1, max = 1}, { id = 'g000ig5101', min = 1, max = 1}), -- свиток устр. гимн, tormentio-броня, слабость, стая

						{id = getTalisman1(playerRace), min = 1, max = 1}, -- Талисман 200

						-- бонус
						rnd({id = 'g001ig0532', min = 1, max = 1}, {id = 'g000ig5009', min = 1, max = 1}, {id = 'g000ig5041', min = 1, max = 1}, {id = 'g001ig0006', min = 1, max = 1}, {id = 'g001ig0130', min = 1, max = 1}), -- Зелье дозорного +1вижн / Свиток "Истинное зрение" / Свиток "Incantare Hellhound" / Эликсир маскировки / Эликсир регенерации


					}
				},
			},
			spells = {
				CapSpell(playerRace)
			}
		}
	}
end

-- сводная зоны 1
function getPlayerZone1(zoneId, playerRace, zoneSize)
	return {
		id = zoneId,
		type = Zone.Junction,
		border = Border.Close,
		race = playerRace,
		size = zoneSize,
		towns = zoneTownsResp0(playerRace),
		merchants = zoneMerch1(),
		mages = zoneMageResp1(),
		ruins = zoneRuinRespZ(),
		mines = getMinesRespZ2(playerRace),
		bags = bags1(),
		stacks = {z1Stacks1(playerRace), z1Stacks2(), z1Stacks3(), z1Stacks4(), z1Stacks5(), z1Stacks6()},
	}
end

-- сводная зоны 2
function getTreasureZone2(zoneId, playerRace, zoneSizeTre)
	return {
		id = zoneId,
		race = playerRace,
		type = Zone.Junction,
		border = Border.Close,
		size = zoneSizeTre,
		towns = zoneTowns2(playerRace),
		merchants = zoneMerch2(),
		ruins = zoneRuinZone2(),
		mines = getMinesZone2(playerRace),
		mercenaries = zoneMercenZone2(playerRace),
		stacks = {z2Stacks1(), z2Stacks2(), z2Stacks3(), z2Stacks4(), z2Stacks5(), z2Stacks6()},
		bags = bags2(),
	}
end

-- сводная зоны 3
function getTreasureZone3(zoneId, zoneSizeTre, b1, b2, bid, rid1, rid2, sid, race)
	local merch = {}
	local mage = {}
	local mercs = {}
	local trainer = {}
	if b1 == 1 or b2 == 1 then
		merch = zoneMerchZone3(bid)
	end
	if b1 == 2 or b2 == 2 then
		mage = zoneMageZone3(bid)
	end
	if b1 == 3 or b2 == 3 then
		mercs = zoneMercenZone3(bid)
	end
	if b1 == 4 or b2 == 4 then
		trainer = {
			{
				name = trainer_c_data[bid].name,
				description = trainer_c_data[bid].description
			}
		}
	end

    local r_stacks = {
        z3Stacks1(rmss()),
        z3Stacks1(rmss()),
        z3Stacks2(b30),
        z3Stacks3(e2),
    }
    if sid == 1 then
        table.insert(r_stacks, z3Stacks4('g001ig0562', rnd('g000ig5091', 'g000ig5055'))) -- Зелье дуэлянта +20крит и Свиток "Tempus status" -33ини / Свиток "Tortio menta" -33точность
    elseif sid == 2 then
        table.insert(r_stacks, z3Stacks4('g001ig0491', rnd('g000ig5039', 'g001ig0586'))) -- Зелье похищения жизни +25вамп и Свиток "Неподкупность" / Свиток "Предательство -20 воры
    elseif sid == 3 then
        table.insert(r_stacks, z3Stacks4('g001ig0355', rnd('g000ig5079', 'g000ig5096'))) -- Зелье тритоньей чешуи +вардурон и Свиток "Защита от Оружия" / Свиток "Прикосновение вампира" +35вамп
    elseif sid == 4 then
        table.insert(r_stacks, z3Stacks4('g001ig0127', rnd('g000ig5012', 'g000ig5013'))) -- Эликсир жизненной силы +50максоз и Свиток "Святая броня" +15 броня / Свиток "Святая сила" +15урон и точн
    end

	return {
		id = zoneId,
		type = Zone.Junction,  -- Junction -- Treasure
		border = getBorderType(zoneId),
		gapChange = 60,
		size = zoneSizeTre,
		merchants = merch,
		mages = mage,
		mercenaries = mercs,
		trainers = trainer,
		mines = getMinesZone3(race),
        ruins = zoneRuinZone3(rid1, rid2),
        stacks = r_stacks,
        bags = bags3(),
	}
end

-- сводная зоны 4
function getTreasureZone4(zoneId, zoneSizeTre, races)
	return {
		id = zoneId,
		type = Zone.Junction,  -- Junction -- Treasure
		border = Border.Open,
		size = zoneSizeTre,
		towns = zoneTownsZone4(),
		ruins = zoneRuinZone4(),
		mines = getMinesZone4(races),
		resourceMarkets = mmc(rMarketsZone3(), {}),
		stacks = { --4+4
            z3Stacks1(rmss()),
            z3Stacks1(rmss()),
            z3Stacks1(rmss()),
			z3StacksX(), -- пермо+15
		},
	}
end

function getMarketZone(zoneId, zoneSize, playerRace1, playerRace2)
	return {
		id = zoneId,
		type = Zone.Treasure,  -- Junction -- Treasure
		border = Border.Close,
		size = zoneSize,
		resourceMarkets = rMarketsZone0(),
		stacks = {
			zmStack(playerRace1),
			zmStack(playerRace2)
		}
	}
end

-------------------------------------------------


-- РАЗМЕРЫ ЗОН: Вернет таблицу с зонами
function getZones(races)
	local z0 = 20
	local z1 = 20
	local z2 = 20
	local z3 = 16
	local zc = 14
	local zm = gmm(0, 6, 6)

	local zones = {}
    local build = {1, 2, 3, 4} 								-- тип торговца: лавка/маг/наемники/тренер
	local bid = {1, 2} 										-- варианты торговцев
    local rid = {1, 2, 3, 4} 								-- варианты руин
    local sid = {1, 2, 3, 4} 								-- варианты отрядов
	local mid = {races[1], races[2], races[3], races[4]} 	-- варианты шахт
	shake(build)
    shake(bid)
    shake(rid)
    shake(sid)
	shake(mage_c_data)
	shake(merchant_c_data)
	shake(merc_c_data)
	shake(trainer_c_data)
	shake(ruins_c_data)
	shake(ruins_t_data)
	shake(spells_special)
	shake(borders1)
	shake(borders2)
	guardRace = getGuardRace(races)

	shake(mines1)
	shake(mines2)
	perks_perm = {}
	zones[1] = getPlayerZone0(0, races[1], z0) -- красный
	zones[2] = getPlayerZone1(1, races[1], z1) -- зелёный
	zones[3] = getTreasureZone2(2, races[1], z2) -- синий

	shake(mines1)
	shake(mines2)
	perks_perm = {}
	zones[4] = getPlayerZone0(11, races[2], z0) -- т.синий
	zones[5] = getPlayerZone1(12, races[2], z1) -- коричневый
	zones[6] = getTreasureZone2(5, races[2], z2) -- серый

	shake(mines1)
	shake(mines2)
	perks_perm = {}
	zones[7] = getPlayerZone0(8, races[3], z0) -- пурпурный
	zones[8] = getPlayerZone1(7, races[3], z1) -- голубой
	zones[9] = getTreasureZone2(6, races[3], z2) -- жёлтый

	shake(mines1)
	shake(mines2)
	perks_perm = {}
	zones[10] = getPlayerZone0(9, races[4], z0) -- оранжавый
	zones[11] = getPlayerZone1(10, races[4], z1) -- т.зеленый
	zones[12] = getTreasureZone2(3, races[4], z2) -- белый

	zones[13] = getTreasureZone3(13, z3, build[1], build[3], bid[1], rid[1], rid[3], sid[1], mid[1]) -- т.серая
	zones[14] = getTreasureZone3(14, z3, build[2], build[4], bid[2], rid[2], rid[4], sid[2], mid[2]) -- т.серая
	zones[15] = getTreasureZone3(15, z3, build[3], build[1], bid[2], rid[3], rid[1], sid[3], mid[3]) -- т.серая
	zones[16] = getTreasureZone3(16, z3, build[4], build[2], bid[1], rid[4], rid[2], sid[4], mid[4]) -- т.серая

	zones[17] = getTreasureZone4(4, zc, races) -- чёрный

	if mmc(false, true) then
		shake(workers_c_data)
		zones[18] = getMarketZone(41, zm, races[1], races[2]) -- т.серый
		zones[19] = getMarketZone(42, zm, races[3], races[4]) -- т.серый
	end

	return zones
end

----------------------

-- ПРОХОДЫ: Вернет таблицу с проходами между зонами:
function getZoneConnections(races)
	local connections = {}

	-- го т0 - т3
	table.insert(connections, {from = 0, to = 13, guard = zoneGuardZone04(races)})
	table.insert(connections, {from = 11, to = 14, guard = zoneGuardZone04(races)})
	table.insert(connections, {from = 8, to = 15, guard = zoneGuardZone04(races)})
	table.insert(connections, {from = 9, to = 16, guard = zoneGuardZone04(races)})

	-- игрок 1: т0 - т1
	table.insert(connections, {from = 0, to = 1})
	table.insert(connections, {from = 0, to = 1})
	table.insert(connections, {from = 0, to = 1, guard = specialGuard1(races[1])})
	table.insert(connections, {from = 0, to = 1})
	table.insert(connections, {from = 0, to = 1})
	-- игрок 1: т1 - т2
	table.insert(connections, {from = 1, to = 2})
	table.insert(connections, {from = 1, to = 2})
	table.insert(connections, {from = 1, to = 2})
	table.insert(connections, {from = 1, to = 2})
	table.insert(connections, {from = 1, to = 2})

	-- игрок 2: т0 - т1
	table.insert(connections, {from = 11, to = 12})
	table.insert(connections, {from = 11, to = 12})
	table.insert(connections, {from = 11, to = 12, guard = specialGuard1(races[2])})
	table.insert(connections, {from = 11, to = 12})
	table.insert(connections, {from = 11, to = 12})
	--игрок 2: т1 - т2
	table.insert(connections, {from = 12, to = 5})
	table.insert(connections, {from = 12, to = 5})
	table.insert(connections, {from = 12, to = 5})
	table.insert(connections, {from = 12, to = 5})
	table.insert(connections, {from = 12, to = 5})

	-- игрок 3: т0 - т1
	table.insert(connections, {from = 8, to = 7})
	table.insert(connections, {from = 8, to = 7})
	table.insert(connections, {from = 8, to = 7, guard = specialGuard1(races[3])})
	table.insert(connections, {from = 8, to = 7})
	table.insert(connections, {from = 8, to = 7})
	-- игрок 3: т1 - т2
	table.insert(connections, {from = 7, to = 6})
	table.insert(connections, {from = 7, to = 6})
	table.insert(connections, {from = 7, to = 6})
	table.insert(connections, {from = 7, to = 6})
	table.insert(connections, {from = 7, to = 6})

	-- игрок 4: т0 - т1
	table.insert(connections, {from = 9, to = 10})
	table.insert(connections, {from = 9, to = 10})
	table.insert(connections, {from = 9, to = 10, guard = specialGuard1(races[4])})
	table.insert(connections, {from = 9, to = 10})
	table.insert(connections, {from = 9, to = 10})
	-- игрок 4: т1 - т2
	table.insert(connections, {from = 10, to = 3})
	table.insert(connections, {from = 10, to = 3})
	table.insert(connections, {from = 10, to = 3})
	table.insert(connections, {from = 10, to = 3})
	table.insert(connections, {from = 10, to = 3})

	-- т2 - т3
	table.insert(connections, {from = 2, to = 13})
	table.insert(connections, {from = 2, to = 13})
	table.insert(connections, {from = 2, to = 13})

	table.insert(connections, {from = 5, to = 14})
	table.insert(connections, {from = 5, to = 14})
	table.insert(connections, {from = 5, to = 14})

	table.insert(connections, {from = 6, to = 15})
	table.insert(connections, {from = 6, to = 15})
	table.insert(connections, {from = 6, to = 15})

	table.insert(connections, {from = 3, to = 16})
	table.insert(connections, {from = 3, to = 16})
	table.insert(connections, {from = 3, to = 16})

	-- т3 - т4
	table.insert(connections, {from = 4, to = 13, guard = z3Stacks5('g001ig0307')})
	table.insert(connections, {from = 4, to = 13, size = 0})
	table.insert(connections, {from = 4, to = 13, guard = specialGuard2()})

	table.insert(connections, {from = 4, to = 14, guard = z3Stacks5('g001ig0309')})
	table.insert(connections, {from = 4, to = 14, size = 0})
	table.insert(connections, {from = 4, to = 14, guard = specialGuard2()})

	table.insert(connections, {from = 4, to = 15, guard = z3Stacks5('g001ig0313')})
	table.insert(connections, {from = 4, to = 15, size = 0})
	table.insert(connections, {from = 4, to = 15, guard = specialGuard2()})

	table.insert(connections, {from = 4, to = 16, guard = z3Stacks5('g001ig0315')})
	table.insert(connections, {from = 4, to = 16, size = 0})
	table.insert(connections, {from = 4, to = 16, guard = specialGuard2()})

	if gmode == 1 then

		-- го т0 - т2
		table.insert(connections, {from = 11, to = 2, guard = zoneGuardZone2()})
		table.insert(connections, {from = 8, to = 5, guard = zoneGuardZone2()})
		table.insert(connections, {from = 9, to = 6, guard = zoneGuardZone2()})
		table.insert(connections, {from = 0, to = 3, guard = zoneGuardZone2()})

		-- т2 - т3
		table.insert(connections, {from = 2, to = 14})
		table.insert(connections, {from = 2, to = 14})
		table.insert(connections, {from = 2, to = 14})

		table.insert(connections, {from = 5, to = 15})
		table.insert(connections, {from = 5, to = 15})
		table.insert(connections, {from = 5, to = 15})

		table.insert(connections, {from = 6, to = 16})
		table.insert(connections, {from = 6, to = 16})
		table.insert(connections, {from = 6, to = 16})

		table.insert(connections, {from = 3, to = 13})
		table.insert(connections, {from = 3, to = 13})
		table.insert(connections, {from = 3, to = 13})

	elseif gmode == 2 then
		-- т0 - т0
		table.insert(connections, {from = 11, to = 0})
		table.insert(connections, {from = 11, to = 0})
		table.insert(connections, {from = 11, to = 0})
		table.insert(connections, {from = 11, to = 0})
		table.insert(connections, {from = 11, to = 0})

		table.insert(connections, {from = 8, to = 9})
		table.insert(connections, {from = 8, to = 9})
		table.insert(connections, {from = 8, to = 9})
		table.insert(connections, {from = 8, to = 9})
		table.insert(connections, {from = 8, to = 9})

		if market_mode == 1 then
			-- т0 - т0
			table.insert(connections, {from = 11, to = 0})
			table.insert(connections, {from = 11, to = 0})

			table.insert(connections, {from = 8, to = 9})
			table.insert(connections, {from = 8, to = 9})

		elseif market_mode == 2 then
			-- рынок - т0
			table.insert(connections, {from = 41, to = 0, size = 0})
			table.insert(connections, {from = 41, to = 11, size = 0})

			table.insert(connections, {from = 42, to = 8, size = 0})
			table.insert(connections, {from = 42, to = 9, size = 0})
		end

		--го т2 - т2
		table.insert(connections, {from = 6, to = 5, guard = zoneGuardZone2()})
		table.insert(connections, {from = 3, to = 2, guard = zoneGuardZone2()})

		-- т2 - т3
		table.insert(connections, {from = 2, to = 13})
		table.insert(connections, {from = 5, to = 14})
		table.insert(connections, {from = 6, to = 15})
		table.insert(connections, {from = 3, to = 16})

	elseif gmode == 3 then
		if market_mode == 1 then
			--т2 - т2 союзников
			table.insert(connections, {from = 2, to = 5})
			table.insert(connections, {from = 2, to = 5})
			table.insert(connections, {from = 2, to = 5})
			table.insert(connections, {from = 2, to = 5})
			table.insert(connections, {from = 2, to = 5})
			table.insert(connections, {from = 2, to = 5})

			table.insert(connections, {from = 3, to = 6})
			table.insert(connections, {from = 3, to = 6})
			table.insert(connections, {from = 3, to = 6})
			table.insert(connections, {from = 3, to = 6})
			table.insert(connections, {from = 3, to = 6})

		elseif market_mode == 2 then
			-- т0 - т0
			table.insert(connections, {from = 0, to = 8, size = 0})
			table.insert(connections, {from = 11, to = 9, size = 0})
			-- рынок - т0
			table.insert(connections, {from = 41, to = 0, size = 0})
			table.insert(connections, {from = 41, to = 8, size = 0})

			table.insert(connections, {from = 42, to = 11, size = 0})
			table.insert(connections, {from = 42, to = 9, size = 0})

			--т2 - т2 союзников
			table.insert(connections, {from = 2, to = 5})
			table.insert(connections, {from = 2, to = 5})

			table.insert(connections, {from = 3, to = 6})
			table.insert(connections, {from = 3, to = 6})
		end

		-- т2 - т3
		table.insert(connections, {from = 2, to = 13})
		table.insert(connections, {from = 5, to = 14})
		table.insert(connections, {from = 6, to = 15})
		table.insert(connections, {from = 3, to = 16})

	end

	return connections
end

-- Дипломатия: возвращает информацию об дип.отношениях
function getDiplomacyRelations(races)
	if gmode == 2 or gmode == 3 then
		return {
			{
				raceA = races[1],
				raceB = races[2],
				relation = 100,
				alliance = true,
				permanentAlliance = true,
			},
			{
				raceA = races[3],
				raceB = races[4],
				relation = 100,
				alliance = true,
				permanentAlliance = true,
			},
			{
				raceA = races[1],
				raceB = races[3],
				relation = 0,
				alwaysAtWar  = true,
			},
			{
				raceA = races[1],
				raceB = races[4],
				relation = 0,
				alwaysAtWar  = true,
			},
			{
				raceA = races[2],
				raceB = races[3],
				relation = 0,
				alwaysAtWar  = true,
			},
			{
				raceA = races[2],
				raceB = races[4],
				relation = 0,
				alwaysAtWar  = true,
			},
		}
	else
		return {}
	end
end

-- Вернет описание содержимого сценария для генератора - ОК
function getTemplateContents(races, scenarioSize, parameters)
	local contents = {}

	if parameters then
		if parameters[1] then
			local n = parameters[1] % 3
			smode = parameters[1]
			if n == 1 then
				gmode = 1
			elseif n == 2 then
				gmode = 2
			elseif n == 0 then
				gmode = 3
			end
		end
		if parameters[2] then
			market_mode = parameters[2]
		end
		if parameters[3] then

		end
		if parameters[4] then
			border_mode = parameters[4]
		end
		if parameters[5] then
			kef = parameters[5] / 100
		end
	end

	if gmode == 1 then
		shake(races)
	elseif gmode == 2 or gmode == 3 then
		local team1 = {races[1], races[2]}
		local team2 = {races[3], races[4]}
		shake(team1)
		shake(team2)
		local teams = {team1, team2}
		shake(teams)
		races = {
			teams[1][1], teams[1][2],
			teams[2][1], teams[2][2],
		}
	end

	contents.diplomacy = getDiplomacyRelations(races)
	contents.zones = getZones(races)
	contents.connections = getZoneConnections(races)

	return contents
end

-- ШАБЛОН
template = {
	name = 'Bladerunner 1.4b [Clover] 1.2 beta5',
	description = 'Черная зона в центре, ее должны касаться 4 т.серых зоны.\nСиняя, белая, желтая, серая зоны должны касаться двух т.серых зон.\nКрасная, т.синяя, пурпурная, оранжевая должны касаться ближайшей т.серой\nАвтор оригинального шаблона Uchenik. Спасибо за поддержку! Карта Тинькофф: 2200700846776804',
	minSize = 72,
	maxSize = 72,
	maxPlayers = 4,
	startingGold = 800,
	startingNativeMana = 150,
	roads = 40,
	forest = 25,
	iterations = 10000,

	customParameters = {
		{
			name = 'Режим',
			values = {
				'FFA',
				'2x2 (т0)',
				'2x2 (т2)',
				'FFA [Бесит!]',
				'2x2 (т0) [Бесит!]',
				'2x2 (т2) [Бесит!]',
			},
			default = gmode
		},
		{
			name = 'Рынок(2x2)',
			values = {
				'Нет',
				'Да',
			},
			default = market_mode
		},
		{
			name = '-',
			values = {
				'-',
			},
		},
		{
			name = 'Границы',
			values = {
				'Открытые',
				'Водные',
				'Полуоткр.',
				'Разные',
				'Одининак.',
				'Зеркально',
			},
			default = border_mode
		},
		{
			name = 'Нейтралы',
			min = 50,
			max = 200,
			step = 10,
			default = 100,
			unit = '%'
		},
	},
forbiddenUnits = {

-- Стандартные
--- Фракционные герои-лидеры и их вторые формы
'g000uu0021', --Архимаг
'g000uu8248', --Архимаг
'g000uu0020', --Следопыт
'g000uu0019', --Рыцарь на Пегасе
'g000uu0022', --Архангел
'g000uu0023', --Вор
'g000uu5300', --Вор
'g000uu0044', --Королевский страж
'g000uu0045', --Инженер
'g000uu0046', --Ученый
'g000uu8249', --Ученый
'g000uu0047', --Старейшина
'g000uu0048', --Вор
'g000uu5301', --Вор
'g000uu0070', --Герцог
'g000uu0071', --Советник
'g000uu0072', --Архидьявол
'g000uu8250', --Архидьявол
'g000uu0073', --Баронесса
'g000uu0074', --Вор
'g000uu5302', --Вор
'g000uu0096', --Рыцарь Смерти
'g000uu0097', --Носферату
'g000uu8252', --Носферату
'g000uu0098', --Королева личей
'g000uu8253', --Королева личей
'g000uu0099', --Баньши
'g000uu0100', --Вор
'g000uu5303', --Вор
'g000uu8251', --Дриада
'g000uu8010', --Дриада
'g000uu8009', --Вассал леса
'g000uu8011', --Страж леса
'g000uu8012', --Мудрец
'g000uu8013', --Вор
'g000uu5304', --Вор

--- Фракционные герои-солдаты
'g001uu0021', --Архимаг
'g001uu0020', --Следопыт
'g001uu0019', --Рыцарь на Пегасе
'g001uu0022', --Архангел
'g001uu0023', --Вор
'g001uu0045', --Инженер
'g001uu0044', --Королевский страж
'g001uu0046', --Ученый
'g070uu0003', --Ученый
'g001uu0047', --Старейшина
'g001uu0048', --Вор
'g001uu0072', --Архидьявол
'g070uu0004', --Архидьявол
'g001uu0071', --Советник
'g001uu0070', --Герцог
'g001uu0073', --Баронесса
'g001uu0074', --Вор
'g001uu0098', --Королева личей
'g070uu0001', --Носферату
'g001uu0097', --Носферату
'g001uu0096', --Рыцарь Смерти
'g001uu0099', --Баньши
'g001uu0100', --Вор
'g001uu8010', --Дриада
'g070uu0002', --Дриада
'g001uu8009', --Вассал леса
'g001uu8011', --Страж леса
'g001uu8012', --Мудрец
'g001uu8013', --Вор

--- Фракционные призыватели-солдаты с большим кол-вом опыта
'g000uu8185', -- Магистр стихий
'g001uu7598', -- Теневидец
'g001uu8242', -- Xозяин масок
'g000uu0164', -- Повелитель волков

--- Фракционные хиллеры-солдаты с большим кол-вом опыта
'g000uu0017', -- Аббатиса
'g000uu8035', -- Вильсида
'g002uu8039', -- Вердант
'g000uu7570', -- Епископ
'g000uu7569', -- Иерей
'g000uu8264', -- Иерарх
'g000uu0151', -- Прорицательница
'g000uu0013', -- Священник
'g000uu8214', -- Дриолисса
'g000uu8034', -- Солнечная Танцовщица
'g000uu0150', -- Патриарх
'g003uu8039', -- Древо жизни
'g003uu8038', -- Энт целитель
'g000uu8235', -- Сильфида
'g000uu2002', -- Целитель
'g003uu8037', -- Священное древо

--- нейтральные лидеры с низкой неподкупностью 20%
'g000uu5236', -- Гном
'g000uu5117', -- Гоблин
'g000uu5101', -- Крестьянин
'g000uu8308', -- Молодой триббог
'g000uu5130', -- Разбойник
'g000uu7556', -- Гоблин-жгун
'g000uu7533', -- Псина
'g000uu7510', -- Птица рух лидер
'g000uu7616', -- Гном упырь лидер
'g000uu6004', -- Толстый бес л.
'g000uu5201', -- Сквайр л.
'g000uu7539', -- Колотун
'g000uu7592', -- Торхот
'g000uu7516', -- Энт Малый л.
'g000uu5262', -- Сектант л.
'g000uu7614', -- Искатель рун лидер
'g000uu7553', -- Ведунья-лидер

--- Все нейтральные хиллеры с большим кол-вом опыта (лидеры и солдаты)
'g000uu8287', -- Св.дерево л.
'g000uu8288', -- Энт целитель л.
'g000uu7519', -- Вердант л.
'g000uu8215', -- Дриолисса л.
'g000uu8262', -- Знахарка л.
'g000uu8289', -- Древо жизни л
'g000uu7521', -- Целитель л.
'g000uu5006', -- Великий Оракул
'g000uu8222', -- Волхв л. бафер
'g000uu8218', -- Волхв
'g000uu7544', -- Настоятельница
'g000uu8213', -- Гоблин-шаман
'g001uu8262', -- Знахарка
'g000uu2021', -- Проповедник
'g000uu6107', -- Темный эльф-жрец
'g000uu7619', -- Слуга культа
'g000uu8044', -- Темный Эльф Гаст л.

------------- Bladerunner
'g000uu8266', -- Дроттар--
'g000uu8265', -- дева пламени--
'g001uu0171', -- двойник
'g000uu8217', -- Призрачный дракон л.
'g000uu8216', -- Призрачный дракон
'g000uu8269', -- Кровавый дракон л.
'g001uu8269', -- Кровавый дракон
'g000uu5022', -- Черный дракон
'g000uu5122', -- Черный дракон л.
'g000uu8144', -- темный эльф гаст л.
'g000uu2007', -- Мумификатор
'g000uu2008', -- Длань Мортис

------------- Водные лидеры
'g000uu8230', -- Чудище
'g000uu5127', -- Кракен
'g000uu5129', -- Морской змей
'g000uu7522', -- Наяда
'g000uu8138', -- Никса
'g000uu5126', -- Русалка
'g000uu7536', -- Элементаль воды

},

forbiddenItems = {

-----------СТАНДАРТНЫЕ
-- ОСНОВНЫЕ
'g000ig6008', --Посох невидимости
'g000ig6017', --Посох дневного света
'g000ig6018', --Посох сумерек
'g000ig5092', --Свиток "terra illudere"
'g000ig0019', --Эликсир молниеносности
'g000ig0020', --Эликсир могущества
'g000ig0017', --Эликсир неуязвимости
'g001ig0126', --Эликсир Всевышнего
'g001ig0129', --Зелье вампиризма50
'g001ig0020', --Великая аура вампиризма
'g001ig0035', --Великая аура жизненной силы
'g000ig5051', --Свиток "sanctuera"
'g000ig5083', --Свиток "свет дня"
'g000ig5095', --Свиток "сумерки"
'g000ig8005', --Семимильные сапоги
'g000ig9006', --Сфера окаменения
'g000ig9039', --Сфера ужаса
'g001ig0596', --Линарет

-- ПРЕДМЕТЫ НА УСКОР/РЕЗ МУВОВ
'g000ig5032', --Свиток "Песнь скорости"
'g000ig5053', --Свиток "Paraseus"
'g000ig5094', --Свиток "Псалом Смерти"
'g000ig6004', --Посох парализации
'g000ig6005', --Посох путника
'g001ig0390', --Посох терна
'g001ig0389', --Посох первооткрывателя
'g001ig0513', --Зелье твердого шага

-- ЕЩЁ
'g001ig0575', --Свиток "Подавляющая жизнь

------------- Bladerunner
'g001ig0414', --Отравленный вороний коготь (Артефакт)--
'g000ig3015', --кристалл души (артефакт)--
'g000ig3016', --рог инкуба (артефакт)--
'g001ig0154', --знамя поглощения--
'g001ig0158', --ужасающий топор (артефакт)--
'g000ig3021', --кольцо колдуньи (артефакт)--
'g001ig0023', --аура стремительности--
'g001ig0017', --малая аура троля--
'g000ig9007', --сфера забвения--
'g000ig9040', --сфера ведьм--
'g001ig0296', --сфера жестокости--
'g000ig2007', --ржавые кандалы--
'g001ig0275', --Кулон подстрекательства--
'g000ig1011', --сапоги мореплавания
'g001ig0044', --Сердце океана (Артефакт)

--свитки на мувы
'g000ig5027', --свиток мореплавания
'g000ig5006', --Свиток "Ускорение"--
'g000ig5100', --Свиток "Скорость"--
'g000ig5113', --Свиток "Порыв"--
'g000ig5099', --Свиток "Опутывание"--
'g001ig0094', --Свиток "Поспешность" отступление
'g000ig5120', --Свиток "Проворство" отступление

--общее новое (имба)
'g001ig0386', -- Посох семи ветров
'g001ig0317', --Зелье дьявольских таинств +15 вампирик (пермо 600 дёшево)

--доп
'g000ig9125', --Талисман Лоупрау --т2 оборотни на всё поле (убрал из-за р-н т1 - дёшево 400)
'g000ig9129', --Талисман Медвежьего Гнева (убрал из-за р-н т1)
'g000ig9140', --Талисман лесной колдуньи (имба - превращение)

--доп.новое
'g000ig3008', --Обод мертвых (обидно ну)

--свитки
'g001ig0195', --Свиток "Откровение" (для аутрана не катит)
'g001ig0439', --Свиток "Et seminibus discordiae - Уменьшает лидерство на 1 в области 5x5 (не для аутранера)
'g001ig0440', --Свиток "Проклятие безволия минус лидерство
'g001ig0092', --Свиток "Гниение леса" за 400 в ролле нафиг надо
'g000ig5057', --Свиток "Мerum Facies" Защита от полиморфа за 700 в ролле нафиг надо
'g000ig5118', --Свиток "Ослепления" Уменьшает обзор противника на 3 в радиусе 5х5.
'g000ig5057', --Свиток "Мerum Facies" Защита от полиморфа.
--на урон т4+
'g000ig5090', --Potentia Ignis
'g000ig5056', --Sinestra ignis
'g000ig5086', --Духи льда
'g000ig5112', --Лавина
'g000ig5077', --Огненное дыхание
'g000ig5093', --Смерч Смерти
'g000ig5105', --Утопление
'g000ig5081', --Цепь молний
'g000ig5060', --Deus talonis
'g000ig5019', --Армагеддон
'g000ig5080', --Истребление

--багнутые знамена на опыт
'g001ig0587', -- Знамя мастера
'g001ig0588', -- Знамя тысячи битв

--пермо
'g001ig0519', -- Война престолов(+10 сопротивления ворам)
'g001ig0525', -- Эликсир учености (артефакты)
'g001ig0526', -- Зелье оруженосца (знаменосец)
'g001ig0527', -- Зелье постижения (тайное знание)
'g001ig0528', -- Честный труд (походное снаряжение)
'g001ig0529', -- Каталог магических сфер (сферы)
'g001ig0530', -- Зелье посмертного зовы(талисманы)
},

	getContents = getTemplateContents
}